{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"7db66fe0-caa8-5dd8-82ce-6fcb580f25fb","excerpt":"Geocoding: the process of taking an address as a piece of semi-structured text, and returning a coordinate somewhere on the surface of the…","html":"<p>Geocoding: the process of taking an address as a piece of semi-structured text, and returning a coordinate somewhere on the surface of the Earth. It's very unlikely that you're not going to use an online service to do this. This means a few things. Firstly, that you have to decide on a geocoding provider. Secondly, you're going to have to sit tight while the geocoding takes place. Python can address both of these issues for you.</p>\n<h2><a href=\"https://geopy.readthedocs.org/en/1.11.0/\">GeoPy</a></h2>\n<p>GeoPy is a Python 2/3 module for accessing a whole suite of geocoding web services. As of version 1.10.0, these include: ArcGIS; Baidu; Bing; DataBC; GeocodeFarm; GoecoderDotUS; GeoNames; Google; IGN France; LiveAddress; NaviData; Nominatim (OSM); OpenCage; OpenMapQuest; Yahoo! BOSS Place Finder; What3Words; and Yandex.</p>\n<p>Of these, I would recommend Google if you are OK with a reasonably low limit but high tolerance to poorly-formatted addresses, or otherwise Nominatim. Nominatim is free, requires no API token, and only uses OpenStreetMap data. However, OpenMapQuest is even better, as it is also based on OSM, but doesn't restrict you to geocoding in multiple threads.</p>\n<h2>Basic usage</h2>\n<p>Using GeoPy is great, because it abstracts away all the details of which provider you're connecting to. Although I'm yet to try it, it would be trivial to iterate over a set of providers and actually produce multiple geocoded locations per address, perhaps as part of a process to determine error, or to average the returned locations.</p>\n<p>Here's a short sample demonstrating the simplicity of the module:</p>\n<pre><code class=\"language-python\">from geopy.geocoders import Nominatim\ngeolocator = Nominatim(country_bias='New Zealand', timeout=4)\ngeocoded = geolocator.geocode('Raglan, Waikato', exactly_one=True)\nif geocoded is not None:\n    # success\n    lat = geocoded.latitude\n    lon = geocoder.longitude\nelse:\n    # Here, perhaps you can run the geocoding function again,\n    # after cleaning your input a little bit\n    # Then you have recursion until you get a result!\n    pass\n</code></pre>\n<p>If you want to use OpenMapQuest (for example), you just need to swap it out for Nominatim, and also remove the country bias (which OpenMapQuest doesn't support).</p>\n<h2>Multiprocessing</h2>\n<p>There's still a problem, despite all this. Geocoding takes forever. All web services take some time, really. But geocoding is special, given what is actually going on behind the scenes. A list of roughly 500 addresses, most of which needed the recursion I alluded to above, took me about 15 minutes to resolve. Duane Wilkins <a href=\"https://www.linkedin.com/pulse/easy-address-geocoding-duane-wilkins\">posted on LinkedIn recently</a> that using the Google geocoding service via Google Sheets resulted in about 800 addresses done in about 5 minutes. I suspect that they were clean, but Google is damn fast at geocoding. You'd expect that relative speed difference though: Nominatim is sitting on donated hardware.</p>\n<p>However both of these are very slow, in my opinion. Agonisingly so.</p>\n<p>A good Python free lunch to speed this up is to launch mutliple geoprocessing calls asynchronously. In my case, I had a small number of very long and poorly-formatted adddresses that took forever to resolve because the geocoder had to be performed multiple times, most of which resulted in nothing as the string was progressively cleaned, or indeed stripped of information that the geocoder simply could not understand (\"5 nm out to sea east of Tauranga\" is the best example). What if I could get these slow processes running, and run others alongside, in parallel? This is totally possible! And because Python is batteries-included, it is very, very easy!</p>\n<p>In my case, I had a list of objects (<code>sightings</code>) which are members of a class that has a method called <code>geocode</code> that essentially launches the geocoding routine I showed you above. (In my case, the function doesn't return anything, but has the side-effect of setting each Address object's <code>latitude</code> and <code>longitude</code>.)</p>\n<pre><code class=\"language-python\">import multiprocessing\n\naddresses = # Gather a list of Address objects with a `geocode`\n\ndef geocode_worker(address):\n    address.geocode()\n    return address\n\ndef main():\n    # Start as many worker processes as you have cores\n    pool = multiprocessing.Pool(processes=multiprocessing.cpu_count())\n    # Apply geocode worker to each address, asynchronously\n    addresses = pool.map(geocode_worker, addresses)\n\nif __name__ == '__main__':\n    main()\n</code></pre>\n<p>[[newthought | A quick gotcha!]]\n| The worker function has to be <a href=\"http://docs.python.org/library/pickle.html#what-can-be-pickled-and-unpickled\">able to be pickled</a>. In simple terms, you have to have the worker function at the top level. The above snippet would not work if <code>geocode_worker</code> were defined within <code>main</code>. In that case, you'd see this error:\n| <code>bash | cPickle.PicklingError: Can\\'t pickle &#x3C;type 'function'>: attribute lookup __builtin__.function failed |</code></p>\n<p>[[newthought | Don't use Nominatim for this!]]\n| I made the mistake of <em>not</em> reading <a href=\"https://nominatim.openstreetmap.org/\">the usage restrictions</a> of the Nominatim geocoding service, and forgetting a debug switch, and then launched tens of requests at the same time, repeatedly, hundreds of times, and then had my IP address rate limited. Currently I can't even <em>visit</em> nominatim.openstreetmap.org, let alone use the geocoder.</p>\n<p>The restriction is that you must use a single thread. That is, you must not do what I just showed you using Nominatim as your geocoding service, or you will end-up thrashing their limited resources. You also should really cache the results as they come in.</p>\n<p>However, OpenMapQuest uses Nominatim but does not have usage restrictions. You can launch some nice parallel processes with this geocoder... just be respectful.</p>\n<h2>Results</h2>\n<p>I achieved a speed-up of around 20x over the full set. The small number of dirty addresses that earlier caused the geocoder to hang still did so, but real work was going on around them; they were no longer blocking.</p>\n<p>Looking at the logs, here's what the difference in processing looks like for a sample of my addresses. When you see <code>fail</code>, that is when my recursion kicks in that applies an algorithm to clean the address string before trying to geocode again.</p>\n<pre><code class=\"language-bash\">'Gluepot Road, Oropi, Tauranga, North Island' ← geocoder starting up\n'Gluepot Road, Oropi, Tauranga, New Zealand' ← fail\n'Gluepot Road, Tauranga, New Zealand' -37.8475939 176.1500778 ← success\n'Maungaraki, Lower Hutt, North Island' ← geocoder starting up\n'Maungaraki, Lower Hutt, New Zealand' -41.2058337 174.8800422 ← success\n'Rimutaka Ranges, Wairarapa, North Island' ← geocoder starting up\n'Rimutaka Ranges, Wairarapa, New Zealand' ← fail\n'Rimutaka, Wairarapa, New Zealand' -41.3573081 175.0005109 ← success\n'Mourea, Rotorua, North Island' ← geocoder starting up\n'Mourea, Rotorua, New Zealand' -38.0442035 176.3261444 ← success\n'Tauranga, North Island' ← geocoder starting up\n'Tauranga, New Zealand' -37.6867319 176.1673614 ← success\n'Waihopai Valley, Marlborough, South Island' ← geocoder starting up\n'Waihopai Valley, Marlborough, New Zealand' -41.5149705 173.7897351 ← success\n'At sea off the coast of the Bay of Plenty, North Island' ← geocoder starting up\n'At sea off the coast of the Bay of Plenty, New Zealand' ← fail\n'At Bay Plenty, New Zealand' ← fail\n'sea off the coast of the Bay of Plenty, New Zealand' ← fail\n'Bay of Plenty, New Zealand' -37.9503755 176.938287362 ← success\n'Taupo, North Island' ← geocoder starting up\n'Taupo, New Zealand' -38.6883048 176.0755486 ← success\nDone in 16s\n</code></pre>\n<pre><code class=\"language-bash\">'Gluepot Road, Oropi, Tauranga, North Island' ← geocoder starting up\n'Maungaraki, Lower Hutt, North Island' ← geocoder starting up\n'Rimutaka Ranges, Wairarapa, North Island' ← geocoder starting up\n'Mourea, Rotorua, North Island' ← geocoder starting up\n'Waihopai Valley, Marlborough, South Island' ← geocoder starting up\n'Tauranga, North Island' ← geocoder starting up\n'At sea off the coast of the Bay of Plenty, North Island' ← geocoder starting up\n'Taupo, North Island' ← geocoder starting up\n'Tauranga, New Zealand' -37.6867319 176.1673614 ← success\n'Mourea, Rotorua, New Zealand' -38.0442035 176.3261444 ← success\n'Waihopai Valley, Marlborough, New Zealand' -41.5149705 173.7897351 ← success\n'Taupo, New Zealand' -38.6883048 176.0755486 ← success\n'Gluepot Road, Oropi, Tauranga, New Zealand' ← fail\n'Rimutaka Ranges, Wairarapa, New Zealand' ← fail\n'Maungaraki, Lower Hutt, New Zealand' -41.2058337 174.8800422 ← success\n'At sea off the coast of the Bay of Plenty, New Zealand' ← fail\n'Gluepot Road, Tauranga, New Zealand' -37.8475939 176.1500778 ← success\n'Rimutaka, Wairarapa, New Zealand' -41.3573081 175.0005109 ← success\n'At Bay Plenty, New Zealand' ← fail\n'sea off the coast of the Bay of Plenty, New Zealand' ← fail\n'Bay of Plenty, New Zealand' -37.9503755 176.938287362 ← success\nDone in 4s\n</code></pre>\n<p>Notice the difference? In the latter case, there are multiple processes: 8 addresses get geocoded at once. They don't return in order because they're all happening at the same time and take different lengths of time to complete depending on their complexity. Failing addresses don't prevent others from getting underway, and the whole process is so much smoother.</p>\n<p>The blocking geocoder ran in 16 seconds, while the second took only 4 seconds. Extrapolate that over hundreds of addresses, and before you declare that that is still not worth the effort, look how little code I had to write. It pays off even for very small, one-off jobs.</p>\n<p>There is much more that can be done with Python's built-in multiprocessing, particularly using queues. There are a bunch of third-party modules that also implement the idea. I encourage you to explore, perhaps by looking at tutorials for how to write a daemon, and then make something that polls multiple related APIs at the same time, populating a common database in near real time.</p>","frontmatter":{"title":"Parallel geocoding in Python with geopy","date":"10:24 AM, Thursday September 10, 2015","updated":null,"path":null},"fields":{"slug":"/blog/parallel-geopy/"}}},"pageContext":{"slug":"/blog/parallel-geopy/","previous":{"fields":{"slug":"/blog/mediawatch/"},"frontmatter":{"title":"Mediawatch on the role of data journalism","updated":null,"date":"2015-07-04T01:00:00.000Z","path":null,"tags":["data journalism"]}},"next":{"fields":{"slug":"/blog/spatial-is-not-that-special/"},"frontmatter":{"title":"Spatial isn't that special","updated":null,"date":"2015-11-01T17:00:00.000Z","path":null,"tags":["GIS","opinion"]}}}}