{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"0f374d31-05ea-537f-8340-b8abd318367b","excerpt":"Bill Dollins has a  downright useful tutorial  over on his blog for building a straightforward geodata service with Node, Express…","html":"<p>Bill Dollins has a <a href=\"http://blog.geomusings.com/2013/12/11/building-a-simple-geodata-service-with-node-and-amazon-rds/\">downright useful tutorial</a> over on his blog for building a straightforward geodata service with Node, Express, PostgreSQL and Amazon RDS.</p>\n<p>I’m actually surprised at how few of these sorts of server applications actually exist, given that they’re reasonably straightforward to set up, and marvelous to use. A project I’ve been working on recently at work consists of a WebSocket server (using ws4py) that operates as an aggregator for real-time spatial data from a variety of sources (also implemented as WebSockets). Connecting to it is as simple as <code class=\"language-text\">wss://host:port/api-version/service</code> and then valid GeoJSON gets pushed to the browser. I don’t think I can say much about the project, but I can say it has transformed how I see the delivery of spatial data over the Internet for time-critical applications. I’d love it if the NZTA got around to implementing something like this for its traffic alert APIs.</p>\n<p>I also have the beginnings of a QGIS plugin that connects to a specified WebSocket and will render arriving messages, provided they come as GeoJSON.</p>","frontmatter":{"title":"Geodata web services","date":"09:04 PM, Saturday January 16, 2016","updated":null,"path":null},"fields":{"slug":"/blog/geodata-web-services/"}}},"pageContext":{"slug":"/blog/geodata-web-services/","previous":{"fields":{"slug":"/nd-spatial-indexes-postgis/indes/"},"frontmatter":{"title":"3D spatial indexes in PostGIS","updated":null,"date":"2015-12-19T14:37:19.000Z","path":null,"tags":["PostGIS"]}},"next":{"fields":{"slug":"/blog/cas/cas-saga/"},"frontmatter":{"title":"Crash Analysis System: The Narrative Arc","updated":null,"date":"2016-04-28T21:02:00.000Z","path":null,"tags":["open data","NZTA","NZTA CAS"]}}}}