{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"51eb2730-58a6-50a2-b95d-9eb294ef05fd","excerpt":"Here's an interesting historical map that turned up on  /r/MapPorn  today. Made by Francis Galton for the Proceedings of the Royal…","html":"<p>Here's an interesting historical map that turned up on <a href=\"http://www.reddit.com/r/MapPorn/comments/27yfn0/isochronic_passage_chart_for_travelers_global_map/\" title=\"Link to Reddit thread\">/r/MapPorn</a> today. Made by Francis Galton for the Proceedings of the Royal Geographic Society in 1881, I find it particularly interesting because it represents the state of international travel only a decade or so after my Scottish and Irish ancestors travelled to New Zealand.</p>\n<p>I know the most about the travelling arrangements of my Scottish ancestors. They travelled with a stop over in Cape Town, South Africa. The <a href=\"http://www.ngaiopress.com/blundlst.htm\">Blundell</a> is the ship my ancestors who share my surname were on, and it arrived in Dunedin apparently 40+ days since it left Scotland. Robert Law, who was three years old (!) when he made the journey, eventually married Jean Harrison, who was also on the Blundell (as a one-year-old!). It is precisely that historical fact that provides a direct link to this content you are reading right now. Never complain about a baby crying on a forty-minute flight.</p>\n<p><img src=\"./global-isochrone-travel-time-from-london-1881.jpg\" alt=\"Isochronic passage chart for travellers.\" title=\"Isochronic passage chart for travellers.\"></p>\n<p>The work of cartographers past is often so impressive on their own merits (although I suspect the chaff has been cut with time) yet when you also consider the technology that they <em>didn't</em> have to make their maps... the mind boggles and you realise that all of use currently practising the skill have it so easy. Really, if work of this calibre could be made then, there are no excuses for bad maps now.</p>\n<p>One particular technique I'd like to draw attention to is the shape of the coastlines. They're <em>really wobbly</em>. I suspect this is probably because nice little shapefiles didn't exist for downloading—but the effect that this has is to express that coastlines are complex features even if that complexity isn't well known. Rather than generalise coastlines to rather round shapes (which would be fine at this scale, really), they have been deliberately densified.</p>\n<p>Finally:</p>\n<blockquote>\n<p>It is supposed that local preparations have been made and that other circumstances are favourable.</p>\n</blockquote>\n<p>I love this. These kind of assumptions have been made for over a hundred years in transportation analysis and cartography. Always read the fine print.</p>","frontmatter":{"title":"Global Isochrone Travel Time from London (1881)","date":"10:33 AM, Friday June 13, 2014","updated":null,"path":null},"fields":{"slug":"/blog/global-travel-isochrone-1881/"}}},"pageContext":{"slug":"/blog/global-travel-isochrone-1881/","previous":{"fields":{"slug":"/blog/montreal-transit-video-critique/"},"frontmatter":{"title":"One Day in Montréal","updated":null,"date":"2014-06-12T17:58:10","path":null,"tags":["transport","cartography"]}},"next":{"fields":{"slug":"/blog/the-school-run/"},"frontmatter":{"title":"Commuting and dropping the kids off at school","updated":null,"date":"2014-06-13T17:44:17","path":null,"tags":["transport","thesis","portfolio"]}}}}