{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"0e258090-986a-5fe0-8de7-c5cb5a1fa9d1","excerpt":"I recently stumbled across  the webpage  for the (spatial/geometric/cartograhic) Algorithms Group at  Technische Universiteit Eindhoven…","html":"<p>I recently stumbled across <a href=\"http://www.win.tue.nl/algo/\">the webpage</a> for the (spatial/geometric/cartograhic) Algorithms Group at <em>Technische Universiteit Eindhoven</em> (Eindhoven University of Technology). I highly recommend browsing through some of the manuscripts included on <a href=\"http://www.win.tue.nl/~hermanh//doku.php?id=graduation_projects\">Herman Haverkort's (and students') projects page</a>.</p>\n<p>In particular, I found one entitled <a href=\"http://www.win.tue.nl/~hermanh//stack/Haverkort-cues-about-travel-time.pdf\"><em>Embedding cues about travel time in schematic maps</em></a>. This is an interesting paper on schematic public transport maps, where it is first established that although excellent at allowing users to avoid unnecessary transfers, schematic maps of public transport pay the price of preventing people from determining how long a particular trips are, in both absolute and relative terms.</p>\n<p><img src=\"./Haverkort1.png\" alt=\"Schematic map\"></p>\n<p><img src=\"./Haverkort2.png\" alt=\"Schematic map with travel times\"></p>\n<p><img src=\"./Haverkort3.png\" alt=\"Map shwing stations at actual locations between 50°45 and 53°30 N and 3°30 and 7°00 E\"></p>\n<p>Haverkort presents a range of ideas for getting the best of both worlds, leading to a portfolio of intriguing ideas about hybridised schematic maps with travel time. I've included three of them here, and really encourage you to read the full paper.</p>\n<p><img src=\"./Haverkort4.png\" alt=\"Schematic map with adjusted lines widths, without and with major waters\"></p>\n<p><img src=\"./Haverkort5.png\" alt=\"Schematic map with adjusted line shapes, without and with major waters\"></p>\n<p><img src=\"./Haverkort6.png\" alt=\"Schematic map with loosely packed collection of blob-shaped zones\"></p>\n<p>I think it'd be a brilliant challenge to employ some of these ideas for a local network. There are also some interesting papers on automated graph drawing on the TUE webpage; if you're anything like me, while you can appreciate the necessity and beauty of a one-off piece of cartography, the true Holy Grail is in abstracting and automating the procedure, giving space for updating source information or changing the extent of your geographic focus with minimal to no additional work.</p>\n<p>There are also a bunch of <a href=\"http://www.win.tue.nl/algo/graduated-phd-students.php\">PhD theses</a> that might make some good holiday reading... for uh, weird people like me.</p>\n<p>[[newthought]]\n| Do you have any other interesting theses or manuscripts to read over the summer? Having completed mine in March this year, I feel I'm in a good space to really appreciate the hard work of others in producing one, so I'm looking to read a few.</p>\n<p><strong><em>All images © Herman Haverkort, 2014</em></strong></p>","frontmatter":{"title":"Algorithms Group at Eindhoven University of Technology","date":"12:55 PM, Sunday November 29, 2015","updated":null,"path":null},"fields":{"slug":"/blog/eindhoven-algo-group/"}}},"pageContext":{"slug":"/blog/eindhoven-algo-group/","previous":{"fields":{"slug":"/blog/nzsea/"},"frontmatter":{"title":"New Zealand Spatial Excellence Awards","updated":null,"date":"2015-11-19T02:00:00.000Z","path":null,"tags":["GIS","opinion"]}},"next":{"fields":{"slug":"/blog/travel-demand/"},"frontmatter":{"title":"Vector fields of population travel demand","updated":null,"date":"2015-12-06T18:16:00.000Z","path":null,"tags":["algorithms"]}}}}