{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"8b92998a-7f8e-5ae8-b916-01d04f631336","excerpt":"This may be a strange thing for me to say, given that my postgraduate qualification, and profession is in geographic information systems…","html":"<p>This may be a strange thing for me to say, given that my postgraduate qualification, and profession is in geographic information systems. But I don’t think that spatial is particularly special. People pretend it is, and then use that to justify the selling of ridiculous desktop software and “enterprise” solutions to problems that Paul Ramsey here shows can all be solved in a single (PostGIS) SQL query and some wrapper PHP script alongside a slippy map.</p>\n<p><div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 50%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <div><iframe src=\"https://www.youtube.com/embed/PwVRi37qXn8\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe></div>\n          </div>\n          </div></p>\n<p>Now this headline assertion is not without nuance. While I currently think that 90% of any GIS workflow can and ought to be automated with something like PostGIS-extended PostgreSQL tables, views, <a href=\"https://gist.github.com/alpha-beta-soup/6f0fe6a219a014ca9d4d\">upse</a><a href=\"https://wiki.postgresql.org/wiki/UPSERT\">rts</a> and trigger functions, that last 10% is actually very, very important. It’s where GIS folk <strong>should</strong> be focusing their attention, given the other problems have been solved by technology. Unfortunately, a lot of people seem to get so caught up inefficiently achieving the fundamental 90% of issues that they don’t actually pay attention to the remaining problems that are actually difficult and/or emerging:</p>\n<ol>\n<li>\n<p><strong>Spatial autocorrelation</strong></p>\n</li>\n<li>\n<p><strong>Metadata</strong></p>\n</li>\n<li>\n<p><strong>Cartography</strong></p>\n<!-- {% sidenote \"sn-id-cartography\" \"Interactive and otherwise: bad defaults threaten to undo hundreds of years of cartographic experience.\" %} -->\n</li>\n<li>\n<p>Efficient, client-side implementations of <strong>geometric algorithms</strong></p>\n<!-- - sidenote \"sn-id-turf\" \"Read: [turf.js](https://github.com/Turfjs/turf)\" %} -->\n</li>\n<li>\n<p><strong>Spatial accuracy</strong></p>\n<!-- {% sidenote \"sn-id-sa\" \"I've yet to see a geocoding implementation that even attempts to **record** accuracy!\" %} -->\n</li>\n<li>\n<p><strong>Spatial error</strong></p>\n</li>\n<li>\n<p>Modifiable areal unit problem</p>\n</li>\n<li>\n<p>Ecological fallacy</p>\n</li>\n<li>\n<p>Locational fallacy</p>\n<!-- {% sidenote \"sn-id-lf\" \"e.g. the reduction of an entity to a single point when it is more appropraitly modelled as existing over a mutlidimensional field.\" %} -->\n</li>\n<li>\n<p>Spatial sampling</p>\n</li>\n<li>\n<p><strong>Stochastic processes</strong></p>\n</li>\n</ol>\n<!-- {% sidenote \"sn-id-sp\" \"My own masters thesis considered this issue for measuring public transport accessibility: bus arrival time is a stochastic process, not a deterministic one. Further, spatial data is too often considered to be a random sample with many observations—I posit instead that it be viewed as a single realisation of a stochastic process. This should hardly be radical, but the gap in the literature for thinking like this is enormous.\" %} -->\n<p>Within the spatial profession (i.e. the Twittersphere, where I hear from most of these people), I also don’t feel like enough attention is being paid to emerging and not-so-emerging technologies and how they can revolutionise the way spatial questions are posed and answered, and hopefully assist in shifting some attention to the 10% of real spatial problems, either directly, or by making the 90% more readily accomplishable.</p>\n<ul>\n<li>\n<p><a href=\"https://github.com/neo4j-contrib/spatial\">Spatially-augmented graph databases</a> are something that has been piquing my interest recently and I intend to write a blog post about some experiments shortly. Why is no one really talking about them?</p>\n</li>\n<li>\n<p>I’m not going to hold my breath waiting for the self-delcared GIS commentators on the circle-jerk that is LinkedIn to discuss the relative merits of GeoDjango.</p>\n</li>\n</ul>\n<p>I didn’t even encounter a NetCDF dataset with an arbitrary number of dimensions, embedded metadata, sigma coordinate systems and irregular grid spacing until I started working around oceanographers and meteorologists.</p>\n<p>Why is <a href=\"http://geogig.org/\">GeoGig</a> still in beta? Why is no one really using it?</p>\n<p>Turf.js!</p>\n<p>There are exceptions of course. But if you want to participate in these exceptions, I found some useful advice that builds on the argument that a desktop GIS is increasingly akin to word processing software:</p>\n<blockquote>\n<p>So if you’re considering a GIS career, you might want to reframe the question. Instead of learning ArcGIS and getting a GISP certificate, I would recommend that you choose one of 4 paths:</p>\n</blockquote>\n<ol>\n<li>geospatial or geostatistical analyst;</li>\n<li>cartographer or visualization design expert;</li>\n<li>software developer;</li>\n<li>Geographic Information Scientist;\nOr some combination of the four (and an application area of interest wouldn’t hurt either).  If you only train yourself to be a GIS user you’ll be in the same boat as a professional word processor before too long.</li>\n</ol>\n<p>— <a href=\"http://www.justinholman.com/2012/03/20/spatial-is-indeed-special/\">Justin Holman</a></p>\n<p>As Holman notes, the existence of Microsoft Word didn’t make good writers obsolete. In fact probably the opposite is true.</p>\n<p>I recognise that this post actually comes across as quite condescending. Frankly, I hope it is a little, as that was completely my intention. I mean what I say and a I say what I mean. I know I’m not blameless, and I’m comfortable with that because I recognise it and frequently acquiesce to those who know a lot more than I do about what I make my living in. I know for a fact that a lot of other people aren’t blameless, either. I just worry that many don’t recognise it. As a profession, spatial people should be extolling the merits of the solutions to difficult problems that we have studied. We need less button-clicking, more actual problem solving, because I’m not seeing enough evidence of the latter actually happening.</p>\n<p>We’re not typists, we’re fucking writers, <em>auteurs</em>, creators, scientists, and problem solvers. We should be proud of it… and act like it.</p>","frontmatter":{"title":"Spatial isn't that special","date":"05:00 PM, Sunday November 01, 2015","updated":null}}},"pageContext":{"slug":"/spatial-is-not-that-special/","previous":{"fields":{"slug":"/landsat-8-mosaic/"},"frontmatter":{"title":"Landsat 8 Mosaic","updated":null,"date":"2015-06-22T22:23:49.000Z","path":null,"tags":["landsat"]}},"next":{"fields":{"slug":"/traffic-dashboard/"},"frontmatter":{"title":"NZ Traffic Dashboard","updated":null,"date":"2017-12-31T14:25:00.000Z","path":"/blog/nz-traffic-dashboard","tags":["portfolio","development","react","JavaScript","transport","New Zealand","NZTA"]}}}}