{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"b8289a28-45a0-5f4a-9e7b-bf70e1fb7664","excerpt":"This is an old post, that I’m using to iron out any issues I have importing old content. Looking back at my ambitions for 2017 in early…","html":"<p>This is an old post, that I’m using to iron out any issues I have importing old content.</p>\n<p>Looking back at my ambitions for 2017 in early December, I’ve done OK. Getting married was obviously a huge personal milestone for me. There was one outstanding item that I’d intended to do early in the year that instead I decided to devote December to: an interactive traffic dashboard for New Zealand. In my mind’s eye this would be something like a traffic control centre, <a href=\"https://www.stuff.co.nz/national/99897853/curious-city-the-team-that-keep-new-zealands-traffic-moving\">like the one in Wellington</a>, which manages about two thirds of the nation’s roads.</p>\n<p>I like to pick at least one new piece of technology when I work on a personal project of this nature. This time it was <a href=\"https://electronjs.org/\">Electron</a>: a way to make cross platform desktop apps using familiar tools for web development. I ended up using <a href=\"https://electronforge.io/\">Electron Forge</a> to make the process even easier, because I’d rather spend time on the actual project than on build configuration.</p>\n<p>The goal for this project was quite a low bar initially: a map that could show the available traffic cameras exposed by the <a href=\"https://www.nzta.govt.nz/traffic-and-travel-information/infoconnect-section-page/about-the-apis/traffic-cameras/\">NZTA traffic camera API</a>. When zooming and panning that map, I wanted the cameras that were displayed in the application to filter according to the <a href=\"https://en.wikipedia.org/wiki/Minimum_bounding_box\">minimum bounding box</a> defined by the user’s current map extent. I wanted this simply because when browsing the NZTA’s website for traffic cameras, I found it frustrating to have to click through menus (text) to access spatial information. To build such an application that could respond the way I wanted, I decided to use <a href=\"https://reactjs.org/\">React</a>, and in particular Google’s Material UI and <a href=\"https://github.com/alex3165/react-mapbox-gl\">this React binding of Mapbox GL JS</a> that I’ve been using for most of this year at work.</p>\n<p>I found that my decision to use Electron (and therefore a local desktop application) eventually led to some other decisions that I hadn’t originally intended: images from cameras could be cached locally on disk, so I store them in a sensible structure and then I can list the contents of each camera’s cache, sort by <a href=\"https://www.unixtutorial.org/2008/04/atime-ctime-mtime-in-unix-filesystems/\">mtime</a>, and create a looping animation for each camera. Anticipating that this would not always be a desktop application, it’s just a configuration change away from using an S3 bucket to cache images and to use that to drive the animation (e.g. using <code class=\"language-text\">listObjectsV2</code> in the AWS JavaScript SDK to order images by modification time).</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">The NZTA traffic camera API only gives you instantaneous results. So I&#39;ma address that: <a href=\"https://t.co/4B0aoe3Lby\">pic.twitter.com/4B0aoe3Lby</a></p>&mdash; ∆ Richard Law (@abetasoup) <a href=\"https://twitter.com/abetasoup/status/936165994837327872?ref_src=twsrc%5Etfw\">November 30, 2017</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>The NZTA APIs</h2>\n<p>In addition to the NZTA traffic camera API, I also used their Variable Message Signs API, the OpenWeatherMap API, the Mapbox vector tile API (with their traffic tiles), and trivial parts of the AWS JS SDK. There’s a handful of pain points about the NZTA APIs that would be nice to see addressed in 2018.</p>\n<ol>\n<li>\n<p><strong>You can’t manage your own API keys.</strong> You have to send an email to a human to request access, and give a reason for wanting access (although my reason was literally just “Curiosity”). Every request must also include a username and password in the request headers. However your username and password are determined <em>for</em> you, and <em>you cannot change them yourself</em>. This all smells a little bit of an immature API and API culture. As the terms of use include a requirement that you keep this information secure, I’d argue that if someone else has control of my password, then I already have no control over the security of it.</p>\n</li>\n<li>\n<p>From doing a bit of digging into how our traffic control centres operate in New Zealand, I realised that <strong>the API only exposes a small fraction of the cameras that are on our roads</strong>. On Twitter <a href=\"https://twitter.com/NZTAWgtn/status/943889798405771264\">the NZTA posted a short video of SH2</a> in Wellington. This camera is video, as opposed to 30/60/240 second stills that the API exposes. It’s also in a particularly useful position. It was argued that this is done to protect privacy (e.g. in the case of a serious accident), but I’m not sure I buy this reasoning. Cameras can already be marked “unavailable” and no images retrieved for as long as that status remains. I’d hope that this feature gets used appropriately. What worries me is whether the NZTA actually has multiple camera systems operating with different APIs. I’m a firm believer in <a href=\"https://en.wikipedia.org/wiki/Eating_your_own_dog_food\">eating your own dog food</a>, so I <strong>hope</strong> that this API doesn’t just exist for external consumption, but rather is used internally.</p>\n</li>\n<li>\n<p><strong>The cameras in Hamilton are almost always “under maintenance”.</strong> This I don’t really understand, unless there’s some network connectivity issue, because it only seems to affect Hamilton. A few of the cameras in Hamilton were reliable, the rest were almost always off.</p>\n</li>\n<li>\n<p><strong>The API responses could be a bit more useful.</strong> For instance the direction that a camera is facing would be a very useful attribute to have. Almost all of the cameras are described as being, for example, ”<em>Northbound</em> on State Highway 1 at Pokeno”. However the cameras are not all fixed, and indeed I watched a few being rotated and zoomed, in 30 second snapshots, as the traffic controllers monitored holiday traffic north of Wellington. They can be panned 360°, tilted, and zoomed. However the only physical camera attribute that is exposed is the location. I parsed the descriptions looking for an indication of direction, and then used that to rotate symbols in the map—but it just made it more confusing (an upside-down camera icon?). The camera facing direction would be great given the ability to tilt and rotate in Mapbox GL.</p>\n</li>\n<li>\n<p><strong>The Variable Message Signs API doesn’t use standard characters for newlines and tabs</strong>, which is a minor annoyance, but irritating nonetheless.</p>\n</li>\n</ol>\n<h2>Wrapping up</h2>\n<p>All in all, this was a fun little distraction for the past month. I think it was a good idea to “time box” myself to avoid some bad habits, but also because it means I can now move on to something else for the month of January without feeling guilty. I don’t consider the project “finished”, although nothing ever really is, so I will probably revisit it later in the year. The code is on Github <a href=\"https://github.com/alpha-beta-soup/traffic-dash\">here</a> and there is also a loose Kanban-stype project board for it <a href=\"https://github.com/alpha-beta-soup/traffic-dash/projects/1\">here</a> where I’ve recorded the ideas I have for it.</p>\n<h2>Demo</h2>\n<p><figure class=\"blog-figure\"><img src=\"/Peek%202017-12-31%2015-35-6d1559632146b56c21c079c98b40c88a.gif\" title=\"A brief snapshot of &#x22;Traffic Dash&#x22; in action.\" class=\"blog-img\"><figcaption class=\"blog-figcaption\">A brief snapshot of “Traffic Dash” in action.</figcaption></figure></p>","frontmatter":{"title":"NZ Traffic Dashboard","date":"02:25 PM, Sunday December 31, 2017","updated":null}}},"pageContext":{"slug":"/traffic-dashboard/","previous":{"fields":{"slug":"/landsat-8-mosaic/"},"frontmatter":{"title":"Landsat 8 Mosaic","updated":null,"date":"2015-06-22 22:23:49 +1200","path":null,"tags":[]}},"next":{"fields":{"slug":"/gatsby-blog/"},"frontmatter":{"title":"Gatsby Blog","updated":"2018-12-09T23:43:00.000Z","date":"2018-12-08T21:39:00.000Z","path":"/blog/gatsby-blog","tags":["meta"]}}}}