{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"e21ba745-0595-5a87-af1f-6204ab62dac6","excerpt":"This video of Montréal’s transit system fell across my path today, made by Colin Stewart and Ahmed El-Geneidy at McGill University’s School…","html":"<p>This video of Montréal’s transit system fell across my path today, made by Colin Stewart and Ahmed El-Geneidy at McGill University’s School of Urban Planning. I’ve been reading a bit of professor El-Geneidy’s work recently for my own research, and I’ve recently been entertaining the idea of visiting Montréal for an extended period of time once I print a thesis onto a reconstituted tree. Providence?</p>\n<p><div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 50%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <div><iframe src=\"http://www.youtube.com/embed/1ztMm5xmk3M\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe></div>\n          </div>\n          </div></p>\n<p>The video shows 24 hours of transit for the Société de transport de Montréal (STM), from 4:30 in the morning. It drills down to individual scheduled trips. It distinguishes between the green, orange, yellow and blue metro lines as well as buses operating every ten minutes\n(the purple points) and “regular” buses (white).</p>\n<p>It is presented on quite a high-resolution basemap, with plenty of attendant information.</p>\n<p>While it is an interesting look at the network operation, there are a handful of problems I have with this video that anyone reading may like to think about if they are to make their own animation.</p>\n<p>Note: if you’re content with just looking at the cool flashing lights (and it is cool!) don’t bother reading on. I’m going to focus on the negatives and leave the positives as self-evident. Oh, I’m such an optimistic young fellow.</p>\n<h2>Critique</h2>\n<p>Firstly, the information given in the video margins is a little overbearing, and isn’t even what I would consider to be the most important information. We are not told what day of the week is represented (weekday schedules are typically different from Saturday and Sunday schedules), or where the data is from. Even in the video description, we have no link to further information. It almost seems as though it is a recruitment device for transit buffs to hit McGill’s website. Which worked for me, let it be known, but I’d still like some more information on how this was constructed—especially if it is made with open data.</p>\n<p>The margin of the video could be improved if the unnecessary information was removed entirely (and left to text descriptions or the embedding web page) or allowed to fade out after the first 20 or so seconds. Ideally, only time would remain after this introductory period.</p>\n<p>The base map, although nice in isolation, is too distracting. The blue ‘pops’ when it is the least important piece of information on the map. The St. Lawrence River can be used here to give context to the map, but even in this capacity the basemap works against intuition by orienting the map away from north. As a foreigner, I am only vaguely aware of the shape of Montréal, but I still would have recognised it immediately if north was up as per convention. In short, the colours and orientation of the basemap ensure the basemap fails at its primary goal of providing immediate contextual recognition.</p>\n<p>Both colour and size are used to distinguish the types of modes represented, which is appropriate. For the metro lines, the yellow and orange are hard to distinguish on moving objects that (seem?) to share a line, although the use of a track is good. I don’t know if the capacity of a vehicle on the metro is several orders of magnitude greater than a bus, but it probably is, and the relative size of the metro to the buses is appropriate. However I think the metro points are probably a little too big, as they bleed into each other and obscure the bus routes.</p>\n<p>I think the two types of bus should have points of the same size (unless one has a greater per-vehicle capacity), and allow small traces for the vehicles to distinguish the higher frequency in one, which should emerge naturally if they are indeed high-frequency.</p>\n<p>It is also worth asking whether the format is appropriate. Is a video a useful format for presenting this information? The people in the comments seem happy enough, with only one or two pointing out that this shows an idealised system where nothing comes early or late… or arrives with no seats left. Could an interactive data visualisation show the same information with additional value? I think so; particularly in that I’d like to zoom into particular neighbourhoods. I do appreciate, however, that the authors of the video probably did this in their free time, and a video has higher bang for your buck.</p>\n<p>The other in-your-face issue with video as a format is that you’re stuck with the frame rate the authors found most interesting… or bearable given the number of times they must have seen this in preparing it. I’d love to slow it down during the busiest moments, but alas.</p>\n<p>The music! Rarely do you see cartography paired with music, but here it is. Jury’s still out on whether it’s anything more than just a little irritating though.</p>\n<h2>Summary</h2>\n<p>Overall, this is an effective and interesting visualisation, but one that needs a tidy-up around the edges—literally and figuratively.</p>","frontmatter":{"title":"One Day in Montréal","date":"05:58 PM, Thursday June 12, 2014","updated":null}}},"pageContext":{"slug":"/montreal-transit-video-critique/","previous":null,"next":{"fields":{"slug":"/traffic-dashboard/"},"frontmatter":{"title":"NZ Traffic Dashboard","updated":null,"date":"2017-12-31T14:25:00.000Z","path":"/blog/nz-traffic-dashboard","tags":["side projects","development","react","javascript","transport","New Zealand","NZTA","meta"]}}}}