{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"67f196de-35ef-50bb-bbe3-a70fa7afd504","excerpt":"Discrete Global Grids (DGGs) are imaginary mosaics that divide up the surface of a globe. We call each piece of the mosaic a \"cell\" or \"zone…","html":"<p>Discrete Global Grids (DGGs) are imaginary mosaics that divide up the surface of a globe. We call each piece of the mosaic a \"cell\" or \"zone\" and give it a unique identifier, like a social security number.</p>\n<p>The DGG is created carefully so that given the ID of any cell, you can determine the IDs of the cells that are next to it. This makes many kinds of spatial interrogation easier, since we have hidden away the shape of the cell.</p>\n<p>Some DGGs, probably the more useful kind, are also <strong>hierarchical</strong>. This is when each cell contains another mosaic of cells, and is itself part of a bigger cell (just like your parents both have parents, and children). This relationship can keep going (we call that \"recursive\") as the cells get smaller and smaller in terms of the area of the Earth that they each represent.</p>\n<p>There is a similar concept for rasters called \"pyramids\":</p>\n<p><img src=\"https://desktop.arcgis.com/en/arcmap/10.3/manage-data/raster-and-images/GUID-C0C7AE57-89F4-4F71-82C4-062E67CF2349-web.png\"></p>\n<p>So what's the difference? Pyramids are lower resolution versions of a higher-resolution dataset. They are used to make it faster to draw and study spatial data. Constructing pyramids is to construct \"resampled\" versions of your highest-resolution data, using well-known methods of resampling. But pyramids are not used to construct even higher resolution versions of your data.</p>\n<p>pyramids are not created on-the-fly, but must be made before they can be used. Pyramids for rasters are usually stored in a file kept alongside a source dataset. Examples include an <code>.ovr</code> (overview) or <code>.rrd</code> (reduced resolution dataset).</p>\n<p>Pyramid files, like the source raster, can additionally be compressed. Raster formats with <a href=\"https://en.wikipedia.org/wiki/Wavelet_compression\">wavelet-compression</a> (including JPEG 2000) have \"internal\" pyramids—they don't need a pyramid file that sits next to the source file.</p>\n<p>The primary difference is that the layers of a hierarchical DGG are not only downsampled versions of some higher-resolution dataset. Each layer of the hierarchical DGG could contain <em>different</em> attributes. For example, a hierarchical DGG with landuse information for each cell might at a higher level use very broad or mixed classifications, such as \"orcharding\", and as you step down through the levels, cells with an \"orcharding\" parent may be further resolved into \"kiwfruit orcharding\", \"viticulture\", etc. Further still we might discriminate between features within an orchard, such as sheds, shelter belts, and actual plants.</p>\n<p>There is nothing that prevents a hierarchical DGG being used in a similar way to a raster pyramids, particularly if the hierarchical DGG cells contain continuous measurement data. But what's nice about hierarchical DGGs is that you aren't <em>limited</em> to that kind of downsampling.</p>\n<!-- This paragraph needs simplification -->\n<p>What is particularly neat about a hierarchical DGG is that if there is no need to downsample a cell, then we can simply keep the large cell around without further work to split into smaller and smaller pieces—since these pieces would have the same value as the larger cell. This is just like how in some styles of mosaic, you can get away with using large blue pieces to represent a sea.</p>\n<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Great_Britain_Box-hiearchy.png/380px-Great_Britain_Box-hiearchy.png\" alt=\"Hierarchical grid of Great Britain\"></p>\n<p>(Advanced readers may be interested in learning about the idea of <a href=\"https://en.wikipedia.org/wiki/R-tree\">R-trees</a>, and <a href=\"https://en.wikipedia.org/wiki/Hilbert_curve\">Hilbert curves</a>, which also relate to the hierarchical division of space: a <strong>graph</strong> data structure.)</p>\n<p><img src=\"http://s2geometry.io/devguide/img/hilbert-figure.gif\" alt=\"Hilbert curve, from http://www.digizeitschriften.de/dms/img/?PPN=PPN235181684_0038&#x26;DMDID=dmdlog40\"></p>\n<p>Now we can start to see what makes a DGG similar to <em>both</em> raster <em>and</em> vector data. Like vector data, each cell has an identifier and can therefore be associated with any kind of data. Like raster data pyramids, each layer of a hierarchical DGG allows for more detail to emerge.</p>\n<h3>Discrete <em>Global</em> Grids?</h3>\n<p>So far we have been talking about discrete global grids and have shown that they are <em>discrete</em> (each cell is distinct from each other cell) and form a regular <em>grid</em> (each cell has neighbour cells, and for hierarchical DGGs also \"child\" and \"parent\" cells). But we have not explained why they are <strong>global</strong>.</p>\n<p>When making maps of the planet, we have to have some idea of what the planet looks like: how big it is, how round it is, how lumpy it is. This idea of the planet's shape and size is called a <em>datum</em>. Sometimes we need to look at or think about the Earth as being flat (for example, showing maps on flat screens and in books), and like peeling an orange and trying to get all the pieces to lie flat, it's not possible to do this without ripping it apart.</p>\n<p>But if we instead pretend that the planet is like a <a href=\"https://en.wikipedia.org/wiki/Regular_polyhedron\">special \"pointy orange\"</a>, we can get past some problems. One of the best problems we solve is one about how we can keep track of what each faces each of the special pointy orange faces touch: we call this <em>topology</em>. The best thing about the special pointy oranges is that they don't have gaps, yet still look like balls.</p>\n<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/7/73/Dodecahedron.gif\" alt=\"Regular polyhedron example: dodecahedron\"></p>\n<hr>\n<h3>A little aside</h3>\n<p>A lot of this thinking stems from work done by futurist architect Richard (R.) Buckminster Fuller. He is an interesting character in this story. He designed a geodesic dome known as the <a href=\"https://en.wikipedia.org/wiki/Montreal_Biosphere\"><em>La Biosphère</em></a>, which is home to a museum of the environment. In 1927, when experiencing a dark night of the soul and contemplating suicide, <a href=\"https://en.wikipedia.org/wiki/Buckminster_Fuller#cite_note-Sieden-p87-88-12\">he has claimed to have felt himself suspended several feet above the ground</a>, enclosed in a white sphere of light. A voice spoke directly to him:</p>\n<blockquote>\n<p>From now on you need never await temporal attestation to your thought. You think the truth. You do not have the right to eliminate yourself. You do not belong to you. You belong to the Universe. Your significance will remain forever obscure to you, but you may assume that you are fulfilling your role if you apply yourself to converting your experiences to the highest advantage of others.</p>\n</blockquote>\n<p>However, this account was not recorded by Fuller himself at the time he claims it occurred; and this is relevant because Fuller has the most self-documented life in human history—<a href=\"https://en.wikipedia.org/wiki/Dymaxion_Chronofile\"><em>literally</em></a>.</p>\n<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/17-08-islcanus-RalfR-DSC_3883.jpg/1024px-17-08-islcanus-RalfR-DSC_3883.jpg\" alt=\"The Montreal Biosphere\"></p>\n<hr>\n<h3>Back on track...</h3>\n<p>The special pointy orange used to represent the Earth can be made up of different cell shapes, the same as how a mosaic wall can be made of differently-shaped tiles (rectangles, triangles, hexagons). However, we try to avoid using a random selection of shapes, as if the shapes are all the same then it is really fast for us to use computers to tell us things like \"what cells are next to this cell?\"</p>\n<p><img src=\"https://edwardfhughes.files.wordpress.com/2014/02/platonic-solids.jpg\" alt=\"Platonic solids\"></p>\n<p>Different kinds of special pointy oranges are more useful than others. One thing we often want to do is to consider each cell to represent the same size area of the Earth. This is a really handy thing to do when counting things on Earth: if the cells were not the same size, larger cells would be more likely to have things inside them, just because they're bigger. One DGG that does this equal-area stuff is called <strong>HEALPIX</strong> (<strong>h</strong>ierarchical <strong>e</strong>qual <strong>a</strong>rea iso<strong>l</strong>atitude <strong>pix</strong>elisation of a sphere), invented by some people at NASA.</p>\n<p><img src=\"https://healpix.jpl.nasa.gov/images/healpixGridRefinement.jpg\" alt=\"HEALPix\"></p>\n<p>HEALPix begins with 12 base cells. Each level divides these into four smaller ones.</p>\n<p><img src=\"https://healpix.jpl.nasa.gov/images/gorski_f1.jpg\" alt=\"HEALPix\"></p>\n<p>HEALPix only works with <em>spheres</em>: perfectly round balls. Although it looks like it is, Earth is not actually a sphere; it is more like an \"<a href=\"https://en.wikipedia.org/wiki/Ellipsoid\">ellipsoid</a>\". A group of New Zealanders (Gibb, Raichev &#x26; Speth) have taken the idea of HEALPix and made an alternative that works with ellipsoids. (<em>Specifically, with \"ellipsoids of revolution\", which is where two axes of the ellipsoid have the same length. In reality, the Earth isn't an ellipsoid of revolution: since the third axis is shorter than the second, it is closer to an \"[oblate spheroid](<a href=\"https://en.wikipedia.org/wiki/Spheroid#Oblate\">https://en.wikipedia.org/wiki/Spheroid#Oblate</a></em>spheroids)\"._ The WGS84 ellipsoid, which you've probably used <em>a lot</em> is an ellipsoid of revolution, so it's not like this is a huge problem.) rHEALPix does this without losing any of the other things people like about HEALPix.</p>\n<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Ellipsoide.svg/400px-Ellipsoide.svg.png\" alt=\"Sphere, ellipsoid, oblate spheroid\"></p>\n<p>Not happy to just leave it there, rHEALPix is also able to be flattened out to a series of squares that are nicely aligned vertically and horizontally, like a tower of square blocks. Each of these squares contains some more squares (it is hierarchical). This makes rHEALPix easy for a computer to draw on a screen.</p>\n<p>This doesn't mean that a different DGG is worse. Choosing the best one for you depends on what you need to do. rHEALPix is based on squares, and each square in a grid of squares has <em>eight</em> neighbours, but <em>only four</em> of them share a side. Instead, a grid based on hexagons may be better since <em>all six</em> neighbours of a hexagon share a side. If you're thinking about a problem to do with movement, then a DGG with hexagon cells may be better than one with square cells. There is no DGGS that is perfect for every task.</p>\n<p>Hexagons are annoying because it is not possible to make a hierarchical DGG with hexagons: you cannot form a large hexagon out of small hexagons. This does not make such a DGG useless, because this is exactly what Uber uses for its <a href=\"https://eng.uber.com/h3/\">H3 grid</a>, where tight geometric hierarchy isn't as important as a logical hierarchy.</p>\n<p><img src=\"https://1fykyq3mdn5r21tpna3wkdyi-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/Twitter-H3-768x384.png\" alt=\"H3\"></p>\n<p><img src=\":/163981f42bc643e9a91eeb27356815e0\" alt=\"Screenshot from 2021-01-08 17-24-16.png\"></p>\n<hr>\n<h3>Notes</h3>\n<p>A <em>hierarchical DGG</em> is also called a discrete gobal grid <strong>system</strong>, or <em>DGGS</em>. I use \"hierarchical DGG\" and not \"DGGS\" here because it's clearer about the difference between a DGG with one level, and a DGG(S) with nested (\"hierarchical\") levels.</p>\n<p>This has been written with help from xkcd's <a href=\"https://xkcd.com/simplewriter/\"><strong>Simple Writer</strong></a>, which tells me when I use difficult words. I have left some difficult words in because I could not think of words or phrases that I liked better. Here are some options I could have used:</p>\n<p><strong>Mosaic</strong>: picture made up of small tiles.</p>\n<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Christ_Pantocrator_mosaic_from_Hagia_Sophia_2240_x_3109_pixels_2.5_MB.jpg/800px-Christ_Pantocrator_mosaic_from_Hagia_Sophia_2240_x_3109_pixels_2.5_MB.jpg\" alt=\"(Icon of Our Lord and Saviour, Jesus Christ (Mosaic)\"></p>\n<p><strong>Cell</strong> or <strong>zone</strong> (or sometimes <strong>pixel</strong>): one tiny piece of tile in a mosaic.</p>\n<p><strong>Resampling</strong></p>\n<h2>Bibliography</h2>\n<ul>\n<li><a href=\"https://desktop.arcgis.com\">https://desktop.arcgis.com</a>. 2021. <em>Raster Pyramids</em>. Available at: <a href=\"https://desktop.arcgis.com/en/arcmap/10.3/manage-data/raster-and-images/raster-pyramids.htm\">https://desktop.arcgis.com/en/arcmap/10.3/manage-data/raster-and-images/raster-pyramids.htm</a></li>\n<li>JPL. <em>Jet Propulsion Laboratory HEALPix Home Page</em>. Available at: <a href=\"https://healpix.jpl.nasa.gov\">https://healpix.jpl.nasa.gov</a></li>\n<li><a href=\"https://datastore.landcareresearch.co.nz/dataset/rhealpix-discrete-global-grid-system/resource/f6e5726d-07be-460f-89be-bf1c84310972\">The rHEALPix discrete global grid system</a>, Robert Gibb, Alexander Raichev, and Michael Speth, unpublished notes, May 2013.</li>\n<li>Uber Engineering. 2021. <em>H3: Uber's Hexagonal Hierarchial Spatial Index</em>. Available at: <a href=\"https://eng.uber.com/h3/\">https://eng.uber.com/h3/</a></li>\n<li>S2 Geometry. 2021. <em>S2 Geometry Home Page</em>. Available at: <a href=\"http://s2geometry.io/\">http://s2geometry.io/</a></li>\n<li><a href=\"http://webpages.sou.edu/~sahrk/sqspc/pubs/gdggs03.pdf\">Geodesic Discrete Global Grid Systems</a>, Kevin Sahr, Denis White, and A. Jon Kimerling. Cartography and Geographic Information Sciene, vol. 30, no. 2, 2003, pp. 121–134.</li>\n</ul>","frontmatter":{"title":"ELI5: Discrete Global Grid System (DGGS)","date":"11:55 AM, Thursday January 14, 2021","updated":null,"path":null},"fields":{"slug":"/blog/dggs-eli5/"}}},"pageContext":{"slug":"/blog/dggs-eli5/","previous":{"fields":{"slug":"/blog/recently/2019-07-30/"},"frontmatter":{"title":"Recently","updated":"2020-04-29T21:47:00.000Z","date":"2019-07-30T21:30:00.000Z","path":null,"tags":["recently"]}},"next":null}}