{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"fbf3b8f4-448e-56e5-9467-b58a283276e4","excerpt":"For several years, up until at least June 2015, the New Zealand Transport Agency (NZTA) published the data underlying their Crash Analysis…","html":"<p>For several years, up until at least June 2015, the New Zealand Transport Agency (NZTA) published the data underlying their Crash Analysis System (CAS). This included information on every Police-attended road crash or accident in New Zealand, with attendant information on the environment it occurred in, and what was deemed to have contributed to the accident. While the method of publishing this data was primitive,{% sidenote “sn-id-1” “It consisted of one CSV file for each calendar year, with each record in the file heavily encoded. Decoding required automation and a lot of sifting through several PDFs, and a tool to get machine-readable tables from them. An example record is <code class=\"language-text\">&#39;Ashburton District&#39;,&#39;MOORE ST&#39;,&#39;100&#39;,&#39;N&#39;,&#39; &#39;,&#39;WILLIAM ST&#39;,&#39;201531749&#39;,&#39;07/02/2015&#39;,&#39;Sat&#39;,&#39;2335&#39;,&#39;EA&#39;,&#39;CN1V&#39;,&#39;103A 129A &#39;,&#39;M&#39;,&#39;R&#39;,&#39;D&#39;,&#39;DO&#39;,&#39;F &#39;,&#39; &#39;,&#39; &#39;,&#39;C&#39;,&#39;050&#39;,&#39;0&#39;,&#39;0&#39;,&#39;0&#39;,&#39;&#39;,&#39;&#39;,&#39;1499510&#39;,&#39;5137544&#39;,</code> and yes that whitespace in <code class=\"language-text\">&#39;F &#39;</code> is actually meaningful.” %} it was sufficient for people with a little bit of time to spare (me) and an unhealthy obsession with transportation issues (me) to make use of it. While in many ways it was a good example of how not to do open data, at the very least it existed, so <a href=\"http://www.statschat.org.nz/?s=foreign+drivers\">other</a> <a href=\"http://www.mixnmashentry.blogspot.co.nz/\">people</a> could take it and run with it. All the NZTA had to do was sit back and watch, massage new data, and upload a new file every three months.</p>\n<h1>Rising Action</h1>\n<p>When I found this dataset one afternoon in 2014, I set to work making a prototype <a href=\"http://www.nearimprov.com/national-crash-statistics/\">map visualisation</a>. My initial concern at the time was just trying to see the frequency of different type of accidents involving cyclists along my commute home between Wellington and Petone. I wanted to know this for my own curiousity and safety, but I also wanted to share it with members of the <a href=\"https://www.facebook.com/groups/166036183455868/\">Cycle Aware Wellington Facebook group</a>, because I thought it would be useful to them.</p>\n<p>The raw CAS data is useless by itself, so interested people in this group would not be able to use it. If I had to write some code to decode a portion of the CAS data for consumption by people, then I would have to be able to do it for every accident in the system. <a href=\"https://github.com/alpha-beta-soup/national-crash-statistics\">So that’s what I did</a>, very slowly, iteratively, while procrastinating from my university work, with the help of a friend.</p>\n<p>Here’s the first time I sent people to it:</p>\n<br>\n{% maincolumn \"./assets/cas-saga/nzcm-v0-fb.png\" %}\n<p>It was buggy as Hell but seemed well-received, and I was inspired to keep working on it.</p>\n<br>\n{% maincolumn \"./assets/cas-saga/nzcm-v0-db-comments.png\" %}\n<p>Here’s how I first decoded the CAS records:</p>\n<br>\n{% maincolumn \"./assets/cas-saga/nzcm-v0.jpg\" %}\n<p>Here’s how it’s done <a href=\"http://www.nearimprov.com/national-crash-statistics/\">now</a>:</p>\n<br>\n{% maincolumn \"./assets/cas-saga/asburton-example.png\" \"Astute readers will notice that this is the decoded visual summary of the raw data pasted in the margin further up the page. Would you ever have worked that out?\" %}\n<p>To get a sense of the utility of this kind of visualisation, note that the only other way to see this data decoded is to sign up for what I call the “NZTA Experience”. Apparently the NZTA has heard of the Internet, but they make you download an additional program in order to use it… and ask that you please forward all queries to your hand-dandy in-house IT team.</p>\n<br>\n{% fullwidth \"./assets/cas-saga/actual-cas-wtf.png\" %}\n<p>The <a href=\"./assets/cas-saga/cas9-video.wmv\">training</a> <a href=\"./assets/cas-saga/cas12-video.wmv\">videos</a> are a little bit sad/funny. They give an insight into the <em>awesome UI</em> I was missing out on by not signing a license agreement and using their system to view a text file.{% sidenote “sn-id-2” “Credit where it’s due: there’s a lot in that bloated interface that I wouldn’t even attempt to implement. I’m sure it’s useful for a number of use cases. It just would be great if it was possible to use it.” %}</p>\n<p>I took one look at this option before deciding it wasn’t for me. I don’t even know what a “Citrix Receiver 3.1” is, but apparently it’s a Windows thing… NZTA, if you require people to have licenses for proprietary software to access open data, the data is not open.</p>\n<p>I took the liberty of downloading the linked documents, for posterity. Here are links to them:</p>\n<h3><a href=\"./assets/cas-saga/CAS-Privacy-Agreement-v1.docx\"><code class=\"language-text\">CAS-Privacy-Agreement-v1.docx</code></a></h3>\n<p>An MS Word privacy agreement that must be signed to use the NZTA’s CAS viewer. (<a href=\"./assets/cas-saga/CAS-Privacy-Agreement-v1.pdf\">PDF</a>.) In particular, it stipulates that no-one can access or use CAS data unless they have been entitled to do so by the NZTA in writing. I figured that providing the data for download absolved me from this, and these statements were only to be found in relation to accessing the Citrix system. I was never told otherwise. There was no fee associated with using CAS.</p>\n<p>This agreement includes this following <em>Purpose of collection of infomation</em> (emphasis added):</p>\n<blockquote>\n<p>All information collected for use in CAS is collected in order to obtain and analyse accurate data in respect of traffic crashes in New Zealand.  Analysis of the information allows <strong>the NZTA</strong>, <strong>other government agencies</strong>, and <strong>agencies engaged in activities that contribute to the furtherance of road safety in New Zealand</strong> to make significant contributions to crash prevention and wider road safety in New Zealand.  This includes contributing to the achievement of the Government policy objectives recorded in New Zealand’s Road Safety Strategy 2010-2020, Safer Journeys.</p>\n</blockquote>\n<p>So it seems pretty clear that the CAS data is designed from the outset to exclude the wider public from being able to interpret the data.</p>\n<p>It is also abundantly clear that the NZTA is preoccupied with the privacy risks associated with this data:</p>\n<blockquote>\n<p><strong>14.3</strong>\tIn particular the customer must do everything reasonably within its power to prevent any access, use or disclosure of the information other than that which is expressly provided for in this agreement, and will not, or allow a user to, further disclose any information unless the information is in a form in which individuals cannot be identified.</p>\n</blockquote>\n<p>I can see why my map may have ruffled some feathers. I just hope they can see how unreasonable their access to CAS-the-system is, given how useful and important CAS-the-data is.</p>\n<p>To my informal and naïve tastes, there’s a considerable amount of legalse in this document, so I’d really appreciate any interpretations of it (leave a comment).</p>\n<p>Finally, here’s a gem:</p>\n<blockquote>\n<p><strong>13.1</strong>\tThe NZTA will make all reasonable endeavours to provide a secure and reliable system allowing the customer and user to use CAS at all times other than between 5pm and midnight each Saturday, such time being set aside for CAS maintenance.</p>\n</blockquote>\n<h3><a href=\"./assets/cas-saga/guide-to-coded-crash-reports.pdf\"><code class=\"language-text\">guide-to-coded-crash-reports.pdf</code></a></h3>\n<p>My program uses the information in this PDF to decode the raw CSV data to a more meaningful GeoJSON structure, which then gets rendered in your browser. Go to page 15 to see the breakdown of the several hundred possible contributions to a crash. One crash can have as many of these explanations as needed; most explanations are additionally assigned to one of the parties to the crash, keyed by the type of vehicle, even working around the case where there are multiple vehicles of the same type in a crash. That’s a pretty complex structure, and <em>kudos</em> for the NZTA for managing to cram that into a CSV!</p>\n<h3><a href=\"./assets/cas-saga/CASp24.pdf\"><code class=\"language-text\">CASp24.pdf</code></a></h3>\n<p>A report prepared by Beca on some cycling project that includes images showing the NZTA’s CAS interface as it stood.</p>\n<h3><a href=\"./assets/cas-saga/CASp27.pdf\"><code class=\"language-text\">CASp27.pdf</code></a></h3>\n<p>A report prepared by OPUS on a cycling project in Wellington that includes an Appendix showing the use of CAS data, including an almost hieroglyphic map of the movements of parties involved in accidents in their case study area.{% marginfigure ‘mf-id-1’ ‘./assets/cas-saga/heiroglyphics.png’ %}</p>\n<h1>Confrontation</h1>\n<p>Then, in 2015, the data stopped being updated. The last update was for the first three months of 2015, which was published in June that year. The next three months’ of data was due in September, but never came. Then, the links to the old data—all 15.25 years of it—disappeared from the NZTA website in silence. Now, if you wanted to see the CAS data, you had no choice but to sign up for the NZTA Experience. Once there, you would not be able to tell people about any of the disaggregate information you have access to, per the terms of the agreement you have to sign.</p>\n<p>Does that make sense to anyone? Let’s run through what I make of the NZTA’s thought process.</p>\n<ol>\n<li>We are worried about the privacy implications of people looking at details of individual crashes.</li>\n<li>To protect privacy while balancing the need for organisations to actually use this information, the NZTA Experience (<em>SecureCAS</em>) exists to allow people access to CAS only after signing an agreement that stipulates that you can’t show other people disaggregate information.</li>\n<li>Third party applications using the raw data that are not subject to the license agreement should be discouraged through the non-publication of the raw data, in order to protect privacy.</li>\n<li>The data is still open; anyone can access the raw data, it just has to be through the NZTA Experience.</li>\n</ol>\n<p>Right. So I (as a third-party developer) can’t make a web application that displays the details of individual accidents to the public, but any individual member of the public can sign up for <em>SecureCAS</em>. <strong>If privacy is the motivating force for the decision to not publish the raw data, what difference does it make if the public uses my application, or SecureCAS?</strong> Ultimately, if someone wants disaggregate information, they can get it. I just made it easier. I made it so people attending a meeting of the Hutt Cycle Network can pull out a laptop and zoom to an area being discussed, and start using facts instead of perception.{% sidenote “sn-id-3” “When I was a member of this group, I was really happy to see people using it, and finding it easy to access information they didn’t even know existed. I see the publication of the raw data as potentially addressing a power imbalance between the road controlling authorities, who have had knowledge of and access to SecureCAS for years, and Joe Public, who didn’t even know this data was collected.” %}</p>\n<p>When I noticed that the data had not been updated, I sent the following email to the Statistical Analysis team at the NZTA asking for an explanation:</p>\n<blockquote>\n<p><strong>Richard</strong>: I was looking to update my record of the CAS data, but the page I have used in the past no longer exists: <a href=\"https://www.nzta.govt.nz/resources/crash-analysis-system-data/\">https://www.nzta.govt.nz/resources/crash-analysis-system-data/</a><br>\nI noticed a few weeks ago that although it was up, the available data only went as far as March this year. Is this data still available for download?</p>\n</blockquote>\n<blockquote>\n<p><strong>NZTA</strong>: Apologies for the delay in replying to your email. We are currently reviewing the CAS information we have available on our website to make sure it meets our privacy and security standards. As <strong>the new on line data will be summarised information</strong> and I understand you work with geospatial co-ordinates, would you like to apply for CAS access? This will give you access to the same level of information as was previously on the web.</p>\n</blockquote>\n<blockquote>\n<p><strong>Richard</strong>: Yes I suppose I would like to apply for access, provided that the access will not cost me as I’m only using it as a hobbyist.<br>\nHowever I’m using the CAS data to make a public web map (<a href=\"http://www.nearimprov.com/national-crash-statistics/\">http://www.nearimprov.com/national-crash-statistics/</a>) in collaboration with some others. <strong>Will this review mean that my application will not be able to present the disaggregate information to the public?</strong></p>\n</blockquote>\n<blockquote>\n<p><strong>Richard</strong> (after a week without a response): Is there any information on this review available? I have some free time available over this summer I am planning to spend developing my mapping application, but I first need to know if the data will still be able to be made public via my application.</p>\n</blockquote>\n<blockquote>\n<p><strong>NZTA</strong>: Thanks for your email. There is no cost associated with access to CAS, but you will be required to sign a data agreement. <strong>Under this agreement you will only be able to make aggregated information (totals of 4 or more) available through your app. Would you like to proceed with getting CAS access?</strong></p>\n</blockquote>\n<p>I got very confused at this point, by the definition of “access to CAS”. I didn’t want to touch <em>SecureCAS</em> with a ten-foot barge pole. I just wanted the raw data to work with on my own. There was still no explanation as to why it had been removed. To date, there appears to be no information on the NZTA website about any review into CAS, including whether any users of CAS data were consulted.</p>\n<p>I had no plans to sign up to a restrictive license that would make my crash map next to useless for the applications I originally intended it for. <strong>If I have to aggregate accidents to a minimum of four… I… how do you even do that?</strong></p>\n<p><em>No, seriously</em>. Take four accidents at random. One caused by a drunk driver at one in the morning, who hit a pole and was injured severely. One a year earlier at a nearby pedestrian crossing where a driver failed to yield and injured a pedestrian. Another involving a driver reversing from their driveway and hitting a child riding their bike, who later died from their injuries. Another a nose-to-tail caused by a driver actually stopping at a stop sign when the following driver expected them to treat it like a give way sign, but with no one injured. <strong>How do you aggregate these?</strong></p>\n<p>You could perhaps say how many accidents there were, and how many people were injured or killed in this area. But you can’t even say which type of accident is most prevalent, because they’re all different and you’re not allowed to discuss them in isolation. What if the council is proposing to remove the pedestrian crossing because (they argue) it is dangerous? What use is the aggregate data now? If only you could drill down into the raw data and extract that one accident that occurred on a pedestrian crossing and see why it happened!</p>\n<p>What if fewer than four accidents even occurred in your suburb or town? Is it even possible to draw this on a map? Can the NZTA actually provide a concrete précis of what this aggregation is supposed to look like?</p>\n<p><strong>The requirement for aggregation of CAS data in third-party applications completely shuts down the utility of the CAS data, and is extremely difficult to comply with.</strong></p>\n<p>Continuing the email chain, after I essentially told them the above:</p>\n<blockquote>\n<p><strong>NZTA</strong>:  Thanks for your interest in safety data. We are in the process of making a new aggregated CAS data set freely available using the Government’s Open Data initiative. This is the data set that will be publically available from now on without the signing of an agreement. This is the data set you could use for your personal mapping tool.\n<br>\n<strong>If someone wishes to obtain data in addition to that made available to the general public via the open data initiative, they will be required to sign a data agreement to place some conditions on how the data may be used, in order to ensure data is kept appropriately secure and to protect the privacy of those individuals represented in the data set. For example, you would be able to use the data for research purposes and publish the results in an aggregated form.</strong>\n<br>\nI understand, however, that you would like data variables over and above the data that we will be making available via the government open data initiative or that has been published in the past. The way in which we can make certain additional variables available to you is by providing you with CAS access so that you can extract the additional data yourself, however, you will be required to sign a data agreement which places certain conditions on how you may use the data.\n<br>\nThere is no cost associated with access to the CAS data base.\n<br>\nPlease let me know if you wish to discuss.</p>\n</blockquote>\n<p>Here’s my take on the embigged section of that quote:</p>\n<blockquote>\n<p><em>Third party applications cannot show disaggregate information because privacy. If someone wants to see the apparently private information, they sure can, they just have to use SecureCAS.</em></p>\n</blockquote>\n<p>Frankly, this makes no sense whatsoever. All it achieves is putting up a barrier to people making use of the data. I replied to the email:</p>\n<blockquote>\n<p><strong>Richard</strong>: Thank you so much for the clarification about accessing the CAS data.\n<br>\nIs there any documentation about the review into CAS that I may read? My application is predicated on disaggregated data. I’d like to contest that there are valid privacy concerns with the use of the data as it currently stands, and also note that if aggregated, the data is not going to be useful for most of the applications I see for it.\n<br>\nFor example, if required to aggregate to at least four accidents (as previously stated), after I apply multiple filters (e.g. accidents involving pedestrians at a particular pedestrian crossing in Petone 2000-2015 — as I did recently for the Hutt Cycle Network), the number of relevant accidents falls below this number and my map is then no longer useful as an advocacy tool for commenting on highly-local road network changes (a proposed change to the location of the crossing). I can imagine hundreds of possible permutations of the data just like this. If I am only able to show aggregate information, the function of the map will be restricted to commenting on general trends only (e.g. there were x accidents on pedestrian crossings across all of Lower Hutt… but I can’t say where or why exactly). I believe this to be a considerable regression in the utility of the data.\n<br>\nI disagree that there are major privacy concerns that justify changing the service in this way. To the extent that I may be wrong or overruled, I propose that there are better ways of addressing these concerns than requiring aggregation (for example, only specifying an approximate date, or randomising the location slightly, or suppressing the reporting of specific accident codes).\n<br>\nHas there been consultation with the users of the data before these changes were proposed? Myself and others have put considerable volunteer time into my application and I would have made my comments earlier had I known there were going to be changes.\n<br>\nI’m happy to discuss this issue further.</p>\n</blockquote>\n<p>At this point the manager of the Statistical Information team contacted me to arrange a time to discuss in person the issues I was raising. Ultimately this had to be a phone conference between the manager, myself, and James Burgess (Chair, Cycle Aware Wellington).</p>\n<p>I took the call from the rooftop carpark of JB Hi-Fi in central Hamilton, amidst construction noise. During the hour-long phone call James and I felt we were given a fair hearing of our concerns. In particular, we stressed that the requirement to aggregate information is difficult to comply with, and severely diminishes the utility of the data.</p>\n<p>I argued that the privacy concerns are unfounded, because the only way the CAS data is personally identifying is if you already hold additional information about an accident. I also pointed out that news articles already reveal more information than CAS does about serious accidents, but we assured them that my application would never try and link CAS data to any form of media. I conceded that the CAS data did not need to reveal the age of the youngest child involved in an accident,{% sidenote “sn-id-4” “If a child or children are involved in an accident, the age of the youngest child is reported in the raw CAS data. Age is not reported otherwise. Gender is never given.” %} but otherwise CAS data should not be changed at all. We provided concrete use cases for disaggregate data in an easy-to-consume web map format, from the perspective of cycling advocacy. We were assured that our concerns would be taken on board.</p>\n<p>The level of aggregation they were considering was regional, which was worse than I had imagined. The proposed confidentiality agreement would mean only this same level of aggregation would be possible for dissemination.</p>\n<p>There would be a follow-up call in two weeks. It felt good.</p>\n<h1>Falling Action</h1>\n<!-- Lack of information about the decision; unsure how to progress and get decision reviewed -->\n<p>There was no follow-up call.</p>\n<p>The person behind the <a href=\"https://twitter.com/IBCycleWay\">@IBCycleWay</a> Twitter handle asked for access to disaggregate CAS data and recieved this response (emphasis added):</p>\n<blockquote>\n<p><strong>NZTA</strong>: Information from our Crash Analysis System (CAS) is no longer available for download directly from this website. We have recently revised our privacy and confidentiality standards, and the crash information did not meet those new standards. <strong>In some cases, the data included information that, by deduction, meant the person involved could be identified</strong>. The Privacy Act 1993 is about protecting personal information and it is our duty as an Agency to ensure that personal information is protected and confidentiality of output is maintained. That is why we are now required to aggregate or <strong>suppress values under four.</strong>\n<br>\nOver the coming weeks, we are working to make aggregated information available for download from this website. Would you like us to email you when this becomes available?\n<br>\nYou are also able to apply for free access to the data via CAS. Please contact <a href=\"cas.administrator@nzta.govt.nz\">cas.administrator@nzta.govt.nz</a> if you would like to apply for access to CAS.\n<br>\nI hope this is of assistance.</p>\n</blockquote>\n<p>I have no idea what “suppress values under four” means.</p>\n<p>Realising that they were not going to seriously consider my perspective despite all the pestering I’d already put in, I tried another email salvo:</p>\n<blockquote>\n<p><strong>Richard</strong>: Is there any word on the CAS data review? It has now been over a year since disaggregate data on road crashes and accidents has been been made available to the public, which is affecting the ability of safety advocates to comment on road network changes from the local to the national scale. I have heard through Twitter that a decision has been made with respect to this data, but I have not heard anything official and I still cannot find any information on the NZTA website.</p>\n</blockquote>\n<p>I think I’m pissing them off now, because the response didn’t even attempt to address me:</p>\n<blockquote>\n<p>Thanks for your email.\n<br>\nAs previously discussed, people can apply for free access to CAS for the following purposes:\n<br></p>\n</blockquote>\n<ol>\n<li>Informing transport policy and regulations\n<br></li>\n<li>Designing and prioritising a range of network user behaviour and road safety initiatives\n<br></li>\n<li>Supporting funding applications for network and road safety improvements\n<br></li>\n<li>Monitoring and evaluating the effectiveness of road safety initiatives\n<br></li>\n<li>Providing information for research purposes connected with road network user behaviour, road safety and transport policy.\n<br>\nPlease do let us know if you would like to apply for access.\n<br>\nWe are currently working to provide as much aggregated data as possible on our website while maintaining our obligations under the Privacy Act. We will be making this information available over the coming weeks, and will also be providing information as to why the csv files are no longer available. Would you like me to send you a link to the aggregated information when it becomes available?</li>\n</ol>\n<p>That last bit of communication is now two weeks’ old. I thank all those who have reached out to me via <a href=\"https://twitter.com/alphabeta_soup\">Twitter</a>, email and other channels to offer advice and information about this situation; it has all been taken on board. I’m trying to use this blog post to get all the information and my thoughts into one place, before taking the next step.</p>\n<h1>Character Growth and Resolution</h1>\n<p>There is yet to be a satisfactory resolution for this narrative arc. The aggregate data for download still isn’t ready so I can’t comment on it, and my hand still isn’t ready to agree to the terms of their license agreement. My Linux OS can’t even use Citrix. I think. I still don’t know what Citrix is.</p>\n<p>I do have some questions for the NZTA:</p>\n<ol>\n<li><strong>How many privacy issues have actually been encountered to justify this change to operational data?</strong></li>\n<li><strong>Why is there no available information about this review?</strong></li>\n<li><strong>Can you provide a concrete demonstration of how your proposed aggregation of no fewer than four accidents is supposed to work?</strong></li>\n<li><strong>Are you open to alternative suggestions about how to protect the privacy of people who have had the misfortune to be involved in an accident, that do not involve aggregation?</strong></li>\n</ol>\n<p>I have some plans my <a href=\"http://www.nearimprov.com/national-crash-statistics/\">crash map</a>, but they’re mostly shelved until I know that the raw CAS data will be available again:</p>\n<ol>\n<li>Make and expose a public RESTful API to the decoded CAS data, so it’s super easy for even more client applications to proliferate.</li>\n<li>Improve my web map interface, including the ability to search crash causes and filter on those, instead of being limited to the filters that I have baked in.</li>\n<li>Improve my web map with some server-side code, probably the same API I’m willing to write, so that it can display more than 3 months of data without destroying your browser.</li>\n<li>Add some cool smarts to the web map: e.g. draw an irregular shape on the map and get some summary charts reflecting the crashes inside the shape that meet your non-spatial criteria.</li>\n</ol>\n<p>I also have one question for you, the reader. <strong>What can be done?</strong></p>\n<h2>Supplementary links</h2>\n<ol>\n<li>A <a href=\"http://groups.open.org.nz/groups/ninja-talk/messages/topic/4s6b4LltkXJeQaGEmg4fMi#post-4s6b4LltkXJeQaGEmg4fMi\">thread</a> on the Open Data Ninjas about the issue.</li>\n<li>My <a href=\"https://github.com/alpha-beta-soup/national-crash-statistics/issues/53\">Github issue</a> about signing the data agreement, which I do not want to do.</li>\n<li>The NZTA’s <a href=\"https://www.nzta.govt.nz/resources/crash-analysis-system/cas.html\">CAS FAQ</a>, which as of writing seems unchanged, with the exception that the raw data download is missing. Here’s <a href=\"https://www.nzta.govt.nz/resources/crash-analysis-system/\">another, similar link</a>.</li>\n<li>The NZTA’s <a href=\"http://www.nzta.govt.nz/resources/crash-analysis-reports/index.html\">pre-aggregated <em>crash analysis reports</em></a> which summarise CAS data on a regional basis. They’re neat, but personally I want to know about very particular circumstances: I don’t want a summary report, I want data.</li>\n</ol>\n<h2>A note on the snark</h2>\n<p>I do apologise for the level of snark you have just endured. I truly appreciate all the hard work that has gone in to CAS and will continue to go into it. In turn, I hope that those at the NZTA appreciate the frustration that I’ve felt after putting in effort into this application, only for the rug to have been pulled out from underneath it without much explanation. Ultimately we both have similar goals: public safety, and factual information.</p>","frontmatter":{"title":"Crash Analysis System: The Narrative Arc","date":"09:02 PM, Thursday April 28, 2016","updated":null,"path":null},"fields":{"slug":"/cas/cas-saga/"}}},"pageContext":{"slug":"/cas/cas-saga/","previous":{"fields":{"slug":"/gis-se-improvement-tip-1/"},"frontmatter":{"title":"GIS StackExchange Improvement Tip #1","updated":null,"date":"2018-12-10T18:04:00.000Z","path":"/blog/gis-se-improvement-tip-1","tags":["stackexchange"]}},"next":null}}