{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"f0c3e480-7450-52ba-a762-55a9c32aa0be","excerpt":"I’ve just obtained the  spatialparalysis.xyz  domain. I’m going to move my blog here from my old blog/portfolio website (nearimprov.com). I…","html":"<p>I’ve just obtained the <a href=\"https://spatialparalysis.xyz\">spatialparalysis.xyz</a> domain. I’m going to move my blog here from my old blog/portfolio website (nearimprov.com). I wanted to try out Gatsby JS, so that I could build some little React components and include them in various places. I’ve used React a lot over the last two years, and since I’ve accepted a new job with much less web development, I might have the desire to make some components for fun rather than for profit.</p>\n<p>I haven’t written anything this year, but I hope to get back into the swing of things next year when I’m more in my element.</p>\n<h3>Why “Spatial Paralysis”?</h3>\n<p>Well, I really just wanted:</p>\n<ol>\n<li><strong>A domain that is better than “nearimprov.com”.</strong> This was easy, since the old domain communicated exactly nothing. I think I picked it with a random generator of word pairs until I arrived at a pair of words that sounded like more than nothing, but less than anything. I’m not going to renew that domain.</li>\n<li><strong>A domain that communicates “spatial”.</strong> My Masters degree is in geographic information systems. I will talk about it a lot. I will use my knowledge of the area to feed my family. Although I have general reservations about the field, for better or for worse my hat is in the ring. Spatial systems are my speciality, and—momentarily putting aside all forms of imposter syndrome—I’m an expert in the field.</li>\n<li><strong>A silly-therefore-memorable name.</strong> Eventually I settled on a rather crude rhyming pun on “facial paralysis”. I was thinking about other blogs that follow a similar kind of naming strategy, such as the <a href=\"https://www.saltycrane.com/about/\">SaltyCrane Blog</a>.</li>\n</ol>","frontmatter":{"title":"Gatsby Blog","date":"09:39 PM, Saturday December 08, 2018","updated":"10:25 PM, Saturday December 08, 2018"}}},"pageContext":{"slug":"/gatsby-blog/","previous":{"fields":{"slug":"/traffic-dashboard/"},"frontmatter":{"title":"NZ Traffic Dashboard","updated":null,"date":"2017-12-31T14:25:00.000Z","path":"/blog/nz-traffic-dashboard","tags":["side projects","development","react","javascript","transport","New Zealand","NZTA","meta"]}},"next":null}}