{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"0a24c8df-4260-504a-8030-c28394212f13","excerpt":"I have just watched Paul Ramsay’s (CartoDB) breakout presentation from  PGConf Silicon Valley 2015 . I love watching these kinds of videos…","html":"<p>I have just watched Paul Ramsay’s (CartoDB) breakout presentation from <em>PGConf Silicon Valley 2015</em>. I love watching these kinds of videos. They’re reasonably short (~40 minutes) so are good while you’re eating lunch or killing time. They also tend to have little nuggets of wisdom to solve “gotchas” that for some reason no one has ever told you about. This presentation in particular has lots of these for using PostGIS. One I did not know about was the ability to specify an n-dimensional index in PostGIS. The typical way to construct a two-dimensional GIST index in PostGIS is to do:</p>\n<p><code class=\"language-text\"></code>sql\nCREATE INDEX idx ON table USING gist(geom);</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">However if you have XYZ or XYZT data and you want to issue queries that take advantage of these additional dimensions with a multidimensional index, you will need:\n\n{% highlight sql %}\nCREATE INDEX idx ON table USING gist(geom gist_geometry_ops_nd);\n{% endhighlight %}\n\nThe different operator, internally, means that the spatial functions use the `&amp;&amp;&amp;` operator, rather than the `&amp;&amp;` operator.\n\nI have been thinking recently about trying to get my hands on some LiDAR data. Acquiring this data is apparently very difficult at the moment. But if you use PostGIS, you&#39;re now well-equipped to deal with it... if you can get your hands on it :information_desk_person:\n\nIn addition, PostGIS allows you to switch out the geometry library from the Geometry Engine Open Source (GEOS) to the SFCGAL (SF (?) Computational Geometry Algorithms Library). SFCGAL is not as broad as GEOS, so if you do make the switch, internally a lot of your functions will still use GEOS. However, as Paul Ramsay notes, SFCGAL has a bunch of additional functions that GEOS does not. These include some interesting 3D functions:\n\n- `ST_3DIntersection`\n\n- `ST_Tesselate`\n\n- `ST_3DArea`\n\n- `ST_Extrude`\n\n- `ST_ForceLHR`\n\n- `ST_Orientation`\n\n- `ST_Minkowski`\n\n- `ST_StraightSkeleton`\n\n- `ST_ApproximateMedialAxis`\n\n\nSFCGAL will need to be compiled, and then activated within PostgreSQL:\n\n{% highlight sql %}\nCREATE EXTENSION postgis_sfcgal;\nSET postgis.backend = &#39;sfcgal&#39;;\n{% endhighlight %}\n\nThere is also a dedicated PostgreSQL extension for storing point cloud data: [https://github.com/pgpointcloud/pointcloud](https://github.com/pgpointcloud/pointcloud)\n\nAlso in the video, there is a tricky philosophical question, with important geometric implications (never thought I&#39;d say that): *What is the intersection of two disjoint polygons?* The sound of a tree falling in the woods? The sound of one hand clapping? Close. It&#39;s a polygon representing the presence of nothing: `POLYGON EMPTY`. And empty geometry is not `NULL`. It&#39;s actually more like `0` (something with no magnitude, but not exactly nothing).\n\nAnother way to get `GEOMETRY EMPTY` is to use a negative buffer value that is larger than the geometry that is being buffered.\n\n&lt;br&gt;\n&lt;center&gt;&lt;iframe width=&quot;65%&quot; height=&quot;500&quot; src=&quot;http://www.youtube.com/embed/GSuZP89UdGs&quot; frameborder=&quot;0&quot; allowfullscreen&gt;&lt;/iframe&gt;&lt;/center&gt;\n\nWhat did you find useful from this presentation?\n\nIncidentally, if someone can tell me what the &quot;SF&quot; in SFCGAL stands for, I&#39;d really appreciate it. It&#39;s driving me nuts. (Spatial Functions?)</code></pre></div>","frontmatter":{"title":"3D spatial indexes in PostGIS","date":"02:37 PM, Saturday December 19, 2015","updated":null,"path":null},"fields":{"slug":"/nd-spatial-indexes-postgis/indes/"}}},"pageContext":{"slug":"/nd-spatial-indexes-postgis/indes/","previous":{"fields":{"slug":"/travel-demand/"},"frontmatter":{"title":"Vector fields of population travel demand","updated":null,"date":"2015-12-06T18:16:00.000Z","path":"/blog/vector-fields-popn-travel-demand","tags":["algorithms"]}},"next":{"fields":{"slug":"/traffic-dashboard/"},"frontmatter":{"title":"NZ Traffic Dashboard","updated":null,"date":"2017-12-31T14:25:00.000Z","path":"/blog/nz-traffic-dashboard","tags":["portfolio","development","react","JavaScript","transport","New Zealand","NZTA"]}}}}