{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"e67a805f-6926-5927-bdb0-ec34b4d23b4a","excerpt":"Some moons ago, I met Dr Pierre Roudier, who works at  Landcare Research New Zealand , at a workshop on PostGIS being held at the National…","html":"<p>\n  <figure class=\"gatsby-resp-image-figure\" style=\"\">\n  \n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/569127bd8942fb4dd987e15b79be95ef/7cd8e/example.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 34.786117836965296%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAHCAIAAACHqfpvAAAACXBIWXMAAAsSAAALEgHS3X78AAABtklEQVQY0wGrAVT+AGRxVk1eS1xrUmBtUmFtUWRvU3WEaV5tXYaSe9jFs8h7ZqE9K4oqIG9DNphIM5RdRWpmTWJiSFRcRmlzWwBYZExodVlQW0NgalJyf2FpdVtkcV1YaFWMkHnRlHq/dV+ZOyyBMSeFTjySTzlaXUdrcVpbYUtLVD9hbFcAX2xRYnBUS1Q+U2FOYnFZWGRNVF9IcH1mlZuFm4dwoGRQkEAzjDYsj0MybFM9eWpQe31lWGBLTFZAYWxXAF1qUFhkS05YQlViTWFtU1pnT3mCasvItNWymbaJcahbSpo+NIxHOIFMOHZlTYR+ZWBlUFBaRWdyXmp0YABfa1JQWUJZZUxZZExNV0FOWD+/xbf/7eXpknPXiG++Xk2cNSyLPC6EX0iRjXJ8hm5fZ1BWYk9kb1xqc18AZHFWUVxEWmVMWWRLUVtFTVg/s7mt+tbE45Fw1nNayFhHskI4hEc4hHxjgolymp2Ho6aOg4t2XmpZaXNfAHWCY298Xl1nTlplTVVfSE9bRYiBZeOtjeCNcMxnUL5NQK5GO6dmVI5xWoeCa7Kznbu7pJebhXyEcqmqlLD3s7JSGX+XAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"\"What you'll be making: identifying the land that you can feasibly see from the train in the central plateau of New Zealand.\"\n        title=\"What you'll be making: identifying the land that you can feasibly see from the train in the central plateau of New Zealand.\"\n        src=\"/static/569127bd8942fb4dd987e15b79be95ef/b6638/example.png\"\n        srcset=\"/static/569127bd8942fb4dd987e15b79be95ef/60f18/example.png 148w,\n/static/569127bd8942fb4dd987e15b79be95ef/9d7cc/example.png 295w,\n/static/569127bd8942fb4dd987e15b79be95ef/b6638/example.png 590w,\n/static/569127bd8942fb4dd987e15b79be95ef/deb91/example.png 885w,\n/static/569127bd8942fb4dd987e15b79be95ef/990fb/example.png 1180w,\n/static/569127bd8942fb4dd987e15b79be95ef/7cd8e/example.png 1239w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    \n  <figcaption class=\"gatsby-resp-image-figcaption\">What you'll be making: identifying the land that you can feasibly see from the train in the central plateau of New Zealand.</figcaption>\n  </figure>\n      </p>\n<p>Some moons ago, I met Dr Pierre Roudier, who works at <a href=\"http://www.landcareresearch.co.nz/home\">Landcare Research New Zealand</a>, at a workshop on PostGIS being held at the National Institute for Water and Atmospheric Research (<a href=\"https://www.niwa.co.nz/\">NIWA</a>). I was just getting started on PostGIS at the time, having identified that I was probably going to need it for my masters thesis. The two-day session, led by Digital Mapping Solutions New Zealand (<a href=\"http://www.mapsolutions.co.nz/\">DMS</a>), was brilliant. It gave me just enough of an introduction to PostGIS to realise its capability, and a leg-up to explore the rest on my own. I ended up relying entirely on PostGIS for my masters thesis, and now I swear by PostGIS and PL/pgsql as the solution to most issues calling for a spatial database.</p>\n<p>What has this got to do with anything? A few things:</p>\n<ol>\n<li>\n<p>For the love of all things holy, attend events like these if you can. You meet interesting people, get pizza (I ate kangaroo), and get a kick up the bum to learn new things that, honestly, you wouldn’t have bothered learning on your own. (In my case, the only reason I was able to attend was that I’d won a small cash prize for talking about my thesis—so you if you’re studying, try jump on small opportunities like that, too.)</p>\n</li>\n<li>\n<p>Pierre ran a tutorial at the end of the first day on GRASS GIS. It really piqued my interest in GRASS. At the time, I was struggling with a batch viewshed calculation for work using ArcGIS. It was falling over due to the size of the computation. I described the problem to Pierre, and he said that it sounded like something GRASS could do no problem. Problem was, I’d never used GRASS. It looked hard and scary: it barely has a GUI. Pierre gave me a headstart on the computation, and I adapted his example to my need. It wasn’t actually that bad, once I’d seen a complete, straightforward example.</p>\n</li>\n<li>\n<p>I realised the value of a gentle introduction to a new technique, that actually fulfils some goal you have in mind.</p>\n</li>\n</ol>\n<p>This last point is now really important to me. If I’m trying to learn something new, it has never truly helped me to open a book or the documentation and work through silly, disconnected examples one by one. I actually have to make something useful for myself. <strong>Solve your own, tangible problem.</strong></p>\n<p>Doing this gives you enough motivation to finish, to finish well, and to know when you have finished. It also means you run into a wide variety of problems that your textbooks examples never mention; like, how do you write an iterator in bash?</p>\n<h2>What are you going to learn?</h2>\n<p>This is a tutorial on using GRASS, Git, Leaflet, bash, JavaScript, CSS, HTML, and hosting map tiles on Amazon AWS. Yes, all of those. No, not to exhaustion. Rather, I’ve written the tutorial that I would like to have found a few months ago. A tutorial that takes a tangible (albeit frivolous) problem to completion, and uses a realistic combination of tools to solve it. You’ll see how these separate tools come together, and how you could then take pieces here and there and work on something completely different. That’s an effective way to learn, if you invest into the idea of the project, and are willing to use this tutorial as a springboard for your own idea.</p>\n<p>The end result is this <a href=\"/train-landscapes\">interactive map</a>.</p>\n<p class=\"sidenote\">The map tiles are now broken, as I was not willing to pay to host the tiles for long.</p>\n<h2>What I can’t cover</h2>\n<p>I will not cover <a href=\"http://readwrite.com/2013/09/30/understanding-github-a-journey-for-beginners-part-1\">beginning with Git</a>, or fundamental Git concepts. But you’ll learn some commands and how to host an interactive map on the Internet for free with Github pages (<em>gh-pages</em>).</p>\n<p>I will not cover getting started with GRASS. Although this won’t be a terrible introduction, I’m not detailing introductory concepts or using the GUI.{% sidenote ‘sn-id-grass-tutorials’ ‘Try [<a href=\"http://grass.osgeo.org/documentation/first-time-users/\">1</a>], [<a href=\"http://grass.osgeo.org/grass70/manuals/helptext.html\">2</a>] or [<a href=\"http://grasswiki.osgeo.org/wiki/Quick_wxGUI_tutorial\">3</a>] instead, and then come back.’%} I had the benefit of a hands-on GRASS introduction at the DMS/NIWA workshop.</p>\n<p>I won’t be discussion web hosting of maps in much depth. I’m not much of a web developer, and I’ve only tinkered with Amazon AWS to get this to work. I’m not an authority.</p>\n<h2>What do you need?</h2>\n<p>If you want to code along, you’ll need to install GRASS GIS (6.4 or 7.0). Git is optional; if you’re not familiar with it, I’d like to just show you how can use it in a little project like this.</p>\n<p>I use Ubuntu for my desktop operating system. I don’t know how easy GRASS is to install on Windows or Mac, but I like to use the <a href=\"https://launchpad.net/~ubuntugis/+archive/ubuntu/ubuntugis-unstable\">ubuntugis-unstable PPA</a>. This has GRASS 6.4 bundled up. GRASS 7.0 is faster due to the addition of new functions, so use that if you’re comfortable. If you’re not using a flavour of Linux, look into getting a virtual machine set up---it’s surprisingly easy and you’ll not regret it.</p>\n<p>I’m also going to have to assume a modicum of familiarity with GIS, and some programming concepts (variables, iteration, functions, etc.). Yet you also need a willingness to learn! I’m still learning more about programming every day, even though I now get paid to do it, so if there’s anything that I seem to have brushed over, don’t feel too shy to ask me to explain it further.</p>\n<h1>The problem</h1>\n<p>I talked to Pierre about a train trip across the North Island of New Zealand, known as the <em>Overlander</em>. He often takes the train to get to Wellington, and I’ve taken the Overlander several times to get between Auckland and Wellington. It is a lot slower than flying (by around 11+ hours), but personally I find it more enjoyable. In addition to your ability to get some solid solo productive time, it is very scenic. Being Spatial Scientists™, Pierre and I discussed how one could go about quantifying the <em>scenic-ness</em>… <em>scenicity</em>… the <em>je ne sais quoi</em> of the trip.</p>\n<p>To solve this problem, you need to think abstractly about it, and then apply that back to the real problem, phrased in reduced, but practical terms:</p>\n<p><strong>Given a line feature, how can you determine the places that are visible are from the line?</strong></p>\n<p>Translated into the vernacular: if you’re sitting on the train, what can you see out of the window?</p>\n<p>What could be taken into consideration in this case, from a spatial perspective? The most straightforward ideas include: what is the terrain like? (Hills block views of what is behind them.) How far can you see out the window? (<a href=\"http://en.wikipedia.org/wiki/Horizon#Distance_to_the_horizon\">Distance to the horizon</a>, coupled with personal eyesight, and atmospheric refraction.)</p>\n<p>The not-so-straightforward, or even unresolvable issues include: are you on the left or right side of the train? Is the train going north or south? What speed is the train travelling at? Can you actually see out of the window? Is it dark? Are you asleep? Are there trees in the way? Are there tunnels?</p>\n<p>Like all good spatial problems, the difficult issues outnumber the tractable ones. <strong>We’re just going to be thinking about visibility as determined by the bare terrain, using a constant distance to the horizon.</strong> This (arguably) gives us some measurement of the <em>maximum extent</em> of space that is visible, which could be refined further.</p>\n<p>The two most influential decisions are the resolution of our terrain model, which determines blocking, and the distance to the horizon, which in an ideal world considers the curvature of the earth and an observer’s elevation.</p>\n<h3>Setting up with Git</h3>\n<p>Launch your terminal, and navigate to somewhere where we can place a folder of interesting stuff (our project code and input data).</p>\n<p><code class=\"language-text\">git clone</code> my GitHub repository with the following command:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">git</span> clone https://github.com/alpha-beta-soup/train-landscapes</code></pre></div>\n<p>This creates a folder called <code class=\"language-text\">train-landscapes</code> in your current directory, within which the project is “cloned”: duplicated for your local consumption.</p>\n<p>If you browse my Github repository in your web browser via the link in the <code class=\"language-text\">git clone</code> command, you’ll see that I originally “forked” this project from Pierre. That is, he started it, and I carried it on with my own changes. Pierre wrote the initial version of the GRASS procedure, targeting GRASS version 7. I adjusted this script, to make it work a bit faster with a larger input and higher resolution raster terrain model. I also made a second version that would work with GRASS 6.4, which is what I was using at the time. That’s what’s great about Github and open source code generally: being able to take someone else’s idea, and use it or run with it.</p>\n<p>After cloning, you’ll see that there are a few files and folders, if you enter the <code class=\"language-text\">train-landscapes</code> directory. <code class=\"language-text\">.gitignore</code> is a text file with the following contents:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">data/</code></pre></div>\n<p>This tells Git to not track files (or changes to files) in the directory <code class=\"language-text\">data/</code> (which contains the source and output data, like the terrain DEM/hillshade model that I used as input).</p>\n<p>The hillshade and digital elevation model (DEM) I used for this project are several gigabytes in size; I haven’t included them in the project to save you the bandwidth. Likewise, the tiles that actually constitute what you see on the map aren’t on Github either (they’re hosted by Amazon, more on that later). The <code class=\"language-text\">.gitignore</code> file is a handy way to manage issues like this one on excluding large datasets from source control when they don’t need it. For following along with this tutorial, you can download any DEM of New Zealand (projected to NZTM NZGD2000) that you have the rights to use. (You can of course pick a region anywhere else in the world.)</p>\n<p>We also have <code class=\"language-text\">README.md</code>, which is the Markdown file that provides the documentation you can see on the front page of the GitHub repository for this project.</p>\n<p><code class=\"language-text\">index.html</code> is where we have a simple webpage displaying a Leaflet map. We’ll get to this later.</p>\n<p>The directory <code class=\"language-text\">data</code> contains the input vector features I used for this project: the train and road features that we determine visibility from. However, you can’t actually download this directory, as I’ve added it to the <code class=\"language-text\">.gitignore</code>.</p>\n<p>The directory <code class=\"language-text\">source</code> contains the real work: our project code. We can list its contents from the terminal with the <code class=\"language-text\">ls</code> command:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">ls</span> source/*\n\n  generate_los.sh\n  generate_los_70.sh\n  make_map.js\n  obtain_corners.py\n  style.css</code></pre></div>\n<p>The <code class=\"language-text\">generate_los</code> shell scripts (<code class=\"language-text\">.sh</code>) are files that contain a series of commands that will be understood by GRASS GIS, versions 6.4 and 7. Let’s consider them now.</p>\n<h3>GRASS and shell scripts</h3>\n<p>If you have installed GRASS, you can start it up at the command line by running the appropriate command for your version of GRASS: <code class=\"language-text\">grass64</code> or <code class=\"language-text\">grass70</code>.</p>\n<p>After a short moment, a two-window GUI will open up. GRASS uses some concepts and terminology that are pretty hard to get your head around becausr they are different to other GIS programs, particularly the idea of a “mapset”. You should be able to use the default, “PERMANENT” mapset for this tutorial, but I encourage you to look for some other GRASS tutorials that consider making your own mapsets. For now, you can just close or ignore the GUI windows as we will not be using them.</p>\n<p>Let’s consider the GRASS 6.4 code (a shell script written in bash). Open <code class=\"language-text\">generate_los.sh</code> in a text editor. To do this with Gedit from the command line:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">gedit source/generate_los.sh</code></pre></div>\n<p>Browse through the file for a bit.</p>\n<p>The very first line is a “shebang” that just tells the program loader what kind of interpreter to use. Here, we are using bash, as opposed to an alternative UNIX shell, like dash.</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token shebang important\">#!/bin/bash</span></code></pre></div>\n<p>After that, we define a function called <code class=\"language-text\">usage</code>. Usage is called upon when checking inputs to the terminal when the code is executed. The function <code class=\"language-text\">usage</code> prints out a small bit of documentation for our code, telling a user that one of two possible arguments can be used: <code class=\"language-text\">-train</code> or <code class=\"language-text\">-road</code>. Choosing train will make sure the script uses some parameters that apply to travelling by train, and similarly for travelling by road.</p>\n<p class=\"sidenote\">Disclaimer: I don't actually know if this is proper practice for writing what is essentially help documentation. I can't imagine it's too far from this.</p>\n<p>The <code class=\"language-text\">usage</code> function and argument parsing:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">usage() {\n   cat &lt;&lt; EOF\nUsage: generate_los.sh [-train | -road]\n\n-train    perform the viewshed analysis for the train journey\n-road     perform the viewshed analysis for the road journey\nEOF\n   exit 1\n}\n\nif [ $# -ne 1 ]; then\n   # Number of arguments\n   # If there is more or less than one, do usage()\n   usage;\nfi\n\nif [ &quot;$1&quot; != &quot;-train&quot; ] &amp;&amp; [ &quot;$1&quot; != &quot;-road&quot; ]; then\n  usage;\nfi</code></pre></div>\n<p><code class=\"language-text\">if [ $# -ne 1 ]; then</code> considers all of the arguments that a user enters alongside the command to execute the GRASS shell script. If the number of arguments is not equal to one (<code class=\"language-text\">-ne 1</code>), then the condition is reached: run the <code class=\"language-text\">usage</code> function.</p>\n<p><code class=\"language-text\">usage</code> tells our naïve user that they have to run either (and only one of) these commands at the terminal to get things going:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">sh execute_los.sh -train\nsh execute_los.sh -road</code></pre></div>\n<p>Failure to do so simply prints an instruction to the terminal, and causes the script to stop with exit code 1 (<code class=\"language-text\">exit 1</code>), a catch-all for general errors.</p>\n<p>If the number of provided arguments is equal to one, we then check if this argument is in the realms of expectation (argument <code class=\"language-text\">&quot;$1&quot;</code> is <code class=\"language-text\">-train</code> or <code class=\"language-text\">-road</code>). If the first argument is not equal to <code class=\"language-text\">train</code> (<code class=\"language-text\">&quot;$1&quot; != &quot;-train&quot;</code>) or <code class=\"language-text\">-road</code>, then <code class=\"language-text\">usage</code> is triggered again. Otherwise we go on our merry way: setting up some variables according to <code class=\"language-text\">train</code> or <code class=\"language-text\">road</code>:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token keyword\">if</span> <span class=\"token punctuation\">[</span> <span class=\"token variable\">$1</span> <span class=\"token operator\">=</span> <span class=\"token string\">\"-road\"</span> <span class=\"token punctuation\">]</span>\n<span class=\"token keyword\">then</span>\n    LINE_SHP<span class=\"token operator\">=</span><span class=\"token string\">'../data/road/roads.shp'</span> <span class=\"token comment\"># Roads shapefile</span>\n    PTS_FILE<span class=\"token operator\">=</span><span class=\"token string\">\"../data/road/road_points_coords.csv\"</span>\n    <span class=\"token comment\"># ^ An intermediate output of this script; coordinates of LINE_SHP</span>\n    ELEV<span class=\"token operator\">=</span>1.2 <span class=\"token comment\"># Metres above the ground that the observer stands</span>\n    <span class=\"token comment\"># ^ just a guess (note, try include the vehicle, too)</span>\n    OUTFILE<span class=\"token operator\">=</span><span class=\"token string\">\"dist_los_car\"</span> <span class=\"token comment\"># Name of final output raster</span>\n<span class=\"token keyword\">elif</span> <span class=\"token punctuation\">[</span> <span class=\"token variable\">$1</span> <span class=\"token operator\">=</span> <span class=\"token string\">\"-train\"</span> <span class=\"token punctuation\">]</span>\n<span class=\"token keyword\">then</span>\n    <span class=\"token comment\"># We live in a post-shapefile world, baby!</span>\n    LINE_SHP<span class=\"token operator\">=</span><span class=\"token string\">'../data/train/nz-railway-centrelines-topo-150k.gpkg'</span> <span class=\"token comment\"># Rail geopackage</span>\n    PTS_FILE<span class=\"token operator\">=</span><span class=\"token string\">\"../data/train/rail_points_coords.csv\"</span>\n    <span class=\"token comment\"># ^ An intermediate output of this script; coordinates of LINE_SHP</span>\n    ELEV<span class=\"token operator\">=</span>2.5 <span class=\"token comment\"># Metres above the ground that the observer stands</span>\n    <span class=\"token comment\"># ^ just a guess (note, try include the vehicle, too)</span>\n    OUTFILE<span class=\"token operator\">=</span><span class=\"token string\">\"dist_los_rail\"</span> <span class=\"token comment\"># Name of final output raster</span>\n<span class=\"token keyword\">else</span>\n    usage<span class=\"token punctuation\">;</span> <span class=\"token comment\"># shouldn't need this</span>\n<span class=\"token keyword\">fi</span></code></pre></div>\n<p>We define a number of variables that have global scope for the remainder of the script:</p>\n<div class=\"newthought\">\n  <h5>`LINE_SHP`'<h5>\n  <p>A line \"shape\", or vector feature. GRASS is happy accepting a wide variety of vector formats, and we don't even have to specify what they are. In my case, I downloaded both an Esri Shapefile (for the road following State Highway 1 between Auckland and Wellington) and a [GeoPackage](https://github.com/opengeospatial/geopackage) (for the main trunk railroad of the North Island). Before running this script, I used QGIS to remove all features from my original dataset that I wasn't interested in. I could have also performed this filtering in GRASS, which would have had the advantage of making it easier to change my region of interest another time.<p>\n</div>\n<div class=\"newthought\">\n  <h5>`PTS_FILE`'<h5>\n  <p>\"points file\", a dataset that will be created in the course of the script's execution, and represents points spaced along our original line features. These points represent all of the viewing opportunities we are going to calculate viewsheds for.<p>\n</div>\n<div class=\"newthought\">\n  <h5>`ELEV`'<h5>\n  <p>GRASS' viewshed tools allow us to set observer heights. That is, if you're trying to determine what you can see from your house, ideally you'd account for the fact that your eyes are not at ground level. Importantly, **a train is higher up than a car**, and defining the value of this variable *conditionally* allows us to be slightly more germane when coming up with the answer to our problem.</p>\n</div>\n<div class=\"newthought\">\n  <h5>`OUTFILE`'<h5>\n  <p>The name of the final output raster that we'll collect up at the end and open to see the result. As we will see, the final output is actually just a GeoTiff (image with a spatial projection). It's handy to have a different name depending on whether we are calculating train or road visibility, as we wouldn't want one to overwrite the other.</p>\n</div>\n<p>Following the conditional variables, there are some variables that are considered constant regardless of our mode of transport:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">R_DEM<span class=\"token operator\">=</span><span class=\"token string\">'../data/hillshade/nidemreproj'</span> <span class=\"token comment\"># Elevation DEM</span>\nR_RES<span class=\"token operator\">=</span>25 <span class=\"token comment\"># The resolution of the DEM (metres)</span>\nDIST_PTS<span class=\"token operator\">=</span>25 <span class=\"token comment\"># Ideally the resolution of the DEM</span>\nMAX_VIS_DIST<span class=\"token operator\">=</span>30000 <span class=\"token comment\"># Maximum distance visible</span></code></pre></div>\n<div class=\"newthought\">\n  <h5>`DIST_PTS`'<h5>\n  <p>`DIST_PTS` is a really important parameter. It will be used to determine how far our source viewing locations may be from one another. There is no point in this value being smaller than `R_RES`, because two different points that lie within the same cell of our terrain model will have the same viewable cells.</p>\n</div>\n<div class=\"newthought\">\n  <h5>`MAX_VIS_DIST`'<h5>\n  <p>`MAX_VIS_DIST` is also very important. It defines the maximum distance from one of our viewing spots that can be considered visible to an observer. It is stated in the same units as the projection system uses; which in my case is metres.</p>\n</div>\n<p>Together, these global variables determine the precision of our output, and therefore how much of a computational challenge this can be. Taking this to the extreme, you could look at a sub-metre terrain model, and consider a near-continuous movement of a passenger who can see for miles and miles… but you’d need a supercomputer or a very long time to get your output. And when your output is ready, it would still be subject to many of our original limitations (lack of trees is probably the biggest one). Your output would actually be subject to <a href=\"http://en.wikipedia.org/wiki/False_precision\"><strong>false precision</strong></a>: a very important concept in GIScience.</p>\n<p>While testing, I used a <code class=\"language-text\">MAX_VIS_DIST</code> of only 100 metres, and a <code class=\"language-text\">DIST_POINTS</code> of thousands of kilometres. This did not give me the actual output I was after, but tested the logic of the code and calculated very quickly even on the real datasets. The parameter values above are the ones that I used when making the real output, which took several days to calculate. This is still a very expensive calculation!</p>\n<h3>Preparation for GRASS 6.4</h3>\n<p>Next up, we are preparing to actually use the command <code class=\"language-text\">r.los</code> (“raster”.“line of sight”). Here GRASS 7.0 has a strong advantage over GRASS 6.4. <a href=\"http://grass.osgeo.org/grass64/manuals/r.los.html\">The documentation for <code class=\"language-text\">r.los</code></a> states the following:</p>\n<blockquote>\n<p>The time to complete the calculation increases dramatically with the region size. Try to keep the columns and rows under 1000.</p>\n</blockquote>\n<p>The equivalent GRASS 7.0 command, not available in GRASS 6.4 is <code class=\"language-text\">r.viewshed</code>, and it does not suffer so.</p>\n<p>In order to keep the number of rows and columns in our calculation under 1000, we actually need to adjust the variable <code class=\"language-text\">MAX_VIS_DIST</code> while considering <code class=\"language-text\">R_RES</code>, as the two are actually tightly linked. The following commands create a new intermediate variable, <code class=\"language-text\">POS_VIS_DIST</code> (possible visibility distance), which determines the maximum distance we can possibly define as “visible” without exceeding the limit of 1000 rows or 1000 columns in our visibility calculation. If <code class=\"language-text\">POS_VIS_DIST</code> ends up exceeding <code class=\"language-text\">MAX_VIS_DIST</code>, then we opt for <code class=\"language-text\">POS_VIS_DIST</code> by setting <code class=\"language-text\">MAX_VIS_DIST</code> equal to <code class=\"language-text\">POS_VIS_DIST</code>; otherwise we keep on with our original value of <code class=\"language-text\">MAX_VIS_DIST</code>.</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token comment\"># r.los takes a long time, and the manual says to keep</span>\n<span class=\"token comment\"># the number of rows and columns \"under 1000\". Here we</span>\n<span class=\"token comment\"># adjust MAX_VIS_DIST by considering the resolution of</span>\n<span class=\"token comment\"># the raster (R_RES), so that there is a maximum of</span>\n<span class=\"token comment\"># 1000 rows and columns</span>\n\n<span class=\"token comment\"># The maximum possible vis dist to use and still have</span>\n<span class=\"token comment\"># 1000 rows and cols</span>\nPOS_VIS_DIST<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$R_RES</span> * 1000 / 2\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span>\n\n<span class=\"token keyword\">if</span> <span class=\"token punctuation\">[</span> 1 -eq <span class=\"token variable\"><span class=\"token variable\">`</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$POS_VIS_DIST</span> &lt; <span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span><span class=\"token variable\">`</span></span> <span class=\"token punctuation\">]</span>\n<span class=\"token keyword\">then</span>\n  <span class=\"token comment\"># If the maximum distance r.los can sustain exceeds the</span>\n  <span class=\"token comment\"># user-selected value, override it</span>\n  <span class=\"token keyword\">echo</span> <span class=\"token string\">\"The MAX_VIS_DIST parameter has been changed \\n\n  from <span class=\"token variable\">$MAX_VIS_DIST</span> to <span class=\"token variable\">$POS_VIS_DIST</span> for performance \\n\n  reasons.\"</span>\n  MAX_VIS_DIST<span class=\"token operator\">=</span><span class=\"token variable\">$POS_VIS_DIST</span>\n<span class=\"token keyword\">fi</span></code></pre></div>\n<p>To understand this, we should consider what each line is actually doing.</p>\n<p><code class=\"language-text\">POS_VIS_DIST=$(echo &quot;$R_RES * 1000 / 2&quot; | bc -l)</code> instantiates a variable that is equal to the resolution of the raster, multiplied by 500. This represents how many cells in any direction an observer can “look” without the number of rows or columns exceeding 1000. <code class=\"language-text\">bc</code> is a command to access “an arbitrary precision calculator language” (it calculates numbers). The pipe (<code class=\"language-text\">|</code>) is a way to connect the output of the left command to the input of the right command.</p>\n<p>In the shell you could write:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">POS_VIS_DIST<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"25 * 1000 /2\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span>\n<span class=\"token keyword\">echo</span> <span class=\"token variable\">$POS_VIS_DIST</span></code></pre></div>\n<p>And it would spit out the value of your calculation: 12500</p>\n<p>The next piece of logic is to compare this number to our <code class=\"language-text\">MAX_VIS_DIST</code> to see if it is larger:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">if [ 1 -eq `echo &quot;$POS_VIS_DIST &lt; $MAX_VIS_DIST&quot; | bc` ]</code></pre></div>\n<p>Consider the following commands:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">v1=$(echo &quot;10 &lt; 20&quot; | bc -l)\nv2=$(echo &quot;20 &lt; 10&quot; | bc -l)</code></pre></div>\n<p>Can you see that we’re doing inequality checks? The value of <code class=\"language-text\">v1</code> is 1, true (10 is less than 20); the value of <code class=\"language-text\">v2</code> is 0, false (20 is not less than 10). <code class=\"language-text\">if [ 1 -eq result ]</code> then asks “if 1 is equal to result”, or more fluidly, “if result is true”. If it is, then you can see above that we reset <code class=\"language-text\">MAX_VIS_DIST</code> as it violates our 1000 rows and columns constraint.</p>\n<h3>Distance to the horizon</h3>\n<p>Now at this point it is a good idea to point out that I have actually picked arbitrary values for <code class=\"language-text\">MAX_VIS_DIST</code> in this example. There are more robust methods to determine the distance to the visible horizon that depend on the elevation of your position, and the curvature of the earth. The value can actually vary quite markedly. The GRASS documentation offers a nice approximation, but <code class=\"language-text\">r.los</code> itself does not take into account the curvature of the earth:</p>\n<blockquote>\n<p>The curvature of the Earth is not taken into account for these calculations. However, for interest’s sake, a handy calculation for distance to the true horizon is approximated by {% math %}d = \\sqrt{(13 \\times h)}{% endmath %}where <em>h</em> is the height of the observer in meters (above sea level) and <em>d</em> is the distance to the horizon in km. This may be useful for setting the max_dist value.</p>\n</blockquote>\n<p>You could implement this in GRASS with a bit of <code class=\"language-text\">bc</code> and considering the elevation value of each cell beneath each observer point, but I’ll leave that as an exercise for the reader (God I hate that). Consider this a reminder that any proposed solution to a geographic problem can almost always be improved.</p>\n<p>A partial solution is to switch to GRASS 7.0: <a href=\"http://grass.osgeo.org/grass70/manuals/r.viewshed.html\"><code class=\"language-text\">r.viewshed</code></a> allows a <code class=\"language-text\">-c</code> flag that considers the curvature of the earth better than you could—with reference to the current ellipsoid:</p>\n<blockquote>\n<p>By default the elevations are not adjusted for the curvature of the earth. The user can turn this on with flag -c.</p>\n</blockquote>\n<p>However this <strong>still</strong> doesn’t resolve the problem of determining the actual distance to the horizon. In part, this is because that also depends on atmospheric conditions. For example, on an exceptionally clear day, when the atmospheric pressure is just right, you can actually make out Mt. Taranaki when standing on the Kāpiti Coast!</p>\n<h3>Further preparation for the line of sight calculation</h3>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token comment\"># Load shapefile into GRASS</span>\nv.in.ogr dsn<span class=\"token operator\">=</span><span class=\"token variable\">$LINE_SHP</span> output<span class=\"token operator\">=</span>line_feature --o --v\n\n<span class=\"token comment\"># Load elevation raster into GRASS and set it as the computational region</span>\nr.in.gdal --o input<span class=\"token operator\">=</span><span class=\"token variable\">$R_DEM</span> output<span class=\"token operator\">=</span>dem --verbose\n\n<span class=\"token comment\"># Sample points along line</span>\nv.to.points -ivt in<span class=\"token operator\">=</span>line_feature out<span class=\"token operator\">=</span>line_feature_points dmax<span class=\"token operator\">=</span><span class=\"token variable\">$DIST_PTS</span> --o --q\n\n<span class=\"token comment\"># Put point coordinates in text file</span>\nv.out.ascii -r in<span class=\"token operator\">=</span>line_feature_points fs<span class=\"token operator\">=</span>, --quiet <span class=\"token operator\">|</span> <span class=\"token function\">awk</span> -F <span class=\"token string\">\"\\\"*,\\\"*\"</span> <span class=\"token string\">'{print <span class=\"token variable\">$1</span>\",\"<span class=\"token variable\">$2</span>}'</span> <span class=\"token operator\">></span> <span class=\"token variable\">$PTS_FILE</span>\n\nNPTS<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">`</span><span class=\"token function\">cat</span> $PTS_FILE <span class=\"token operator\">|</span> <span class=\"token function\">wc</span> -l<span class=\"token variable\">`</span></span></code></pre></div>\n<p>Try and see if you can work out what this section of code does. If you have GRASS running in your terminal, you can find out what any given GRASS command does with the following pattern: <code class=\"language-text\">r.command --help</code>, which is the same pattern for most commands at a UNIX terminal. You can also consult the online help.</p>\n<p>To summarise the help documents for the GRASS commands used here:</p>\n<ol>\n<li>\n<p><code class=\"language-text\">v.in.ogr</code>: Convert OGR vector layers to GRASS vector map.</p>\n</li>\n<li>\n<p><code class=\"language-text\">r.in.gdal</code>: Import GDAL supported raster file into a binary raster map layer.</p>\n</li>\n<li>\n<p><code class=\"language-text\">v.to.points</code>: Create points along input lines in new vector with 2 layers.</p>\n</li>\n<li>\n<p><code class=\"language-text\">v.out.ascii</code>: Converts a GRASS binary vector map to a GRASS ASCII vector map.</p>\n</li>\n</ol>\n<p>In conjunction with the <code class=\"language-text\">--help</code> option and my comments, try and work out what exactly these comments are doing. They represent a stage of data preparation for the next processing step. Remember that the syntax <code class=\"language-text\">$VARIABLE</code> is a way to access the value of the variable called <code class=\"language-text\">VARIABLE</code>, we defined several of these near the beginning of the script. If you have any questions, leave a comment.</p>\n<h2>Computing viewsheds iteratively</h2>\n<p>The general logic of the viewshed calculation is to take a series of points sampled along a line feature, find all places on the terrain model that a person standing on each point can see, and then mosaic each of these together into a final visibility surface. There are ways to make this smarter, such as using the fact that once a cell has been identified as visible from any point, to never bother querying whether it is visible again. I don’t explore these, although I might if I ever need to re-use this code.</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token keyword\">echo</span> -n <span class=\"token string\">\"\\nComputing viewsheds\\n\"</span>\n\nCOUNTER<span class=\"token operator\">=</span>0\n<span class=\"token keyword\">while</span> <span class=\"token function\">read</span> -r line\n  <span class=\"token keyword\">do</span>\n\n  PCT_FLOAT<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> \"100*<span class=\"token punctuation\">$((</span>COUNTER+1<span class=\"token variable\">)</span></span><span class=\"token punctuation\">)</span>/<span class=\"token variable\">$NPTS</span><span class=\"token string\">\" | bc -l)\n  PCT=<span class=\"token variable\"><span class=\"token variable\">`</span><span class=\"token function\">printf</span> <span class=\"token string\">\"%0.1f\\n\"</span> $PCT_FLOAT<span class=\"token variable\">`</span></span>\n\n  echo -ne \"</span>Processing <span class=\"token variable\">$NPTS</span> viewshed instances: \\t <span class=\"token variable\">$PCT</span> % <span class=\"token punctuation\">(</span><span class=\"token variable\">$COUNTER</span>/<span class=\"token variable\">$NPTS</span><span class=\"token punctuation\">)</span> \\r\"\n\n  <span class=\"token comment\"># Set the region to a smaller subset around the current observer point</span>\n  <span class=\"token comment\">#   to speed processing</span>\n  x<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> $line <span class=\"token operator\">|</span> <span class=\"token function\">cut</span> -f1 -d,<span class=\"token variable\">)</span></span>\n  y<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> $line <span class=\"token operator\">|</span> <span class=\"token function\">cut</span> -f2 -d,<span class=\"token variable\">)</span></span>\n  W<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$x</span>-<span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span>\n  E<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$x</span>+<span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span>\n  N<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$y</span>+<span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span>\n  S<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$y</span>-<span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span>\n  g.region n<span class=\"token operator\">=</span><span class=\"token variable\">$N</span> s<span class=\"token operator\">=</span><span class=\"token variable\">$S</span> e<span class=\"token operator\">=</span><span class=\"token variable\">$E</span> w<span class=\"token operator\">=</span><span class=\"token variable\">$W</span>\n\n  <span class=\"token comment\"># Does not overwrite, so SIGINT (Ctrl+C) can be used to interrupt a</span>\n  <span class=\"token comment\">#  long-running process, to be resumed later</span>\n  <span class=\"token comment\">#  (keep parameters constant between runs)</span>\n  r.los input<span class=\"token operator\">=</span>dem output<span class=\"token operator\">=</span>tmp_los_<span class=\"token variable\">${COUNTER}</span> coordinate<span class=\"token operator\">=</span><span class=\"token variable\">$line</span> obs_elev<span class=\"token operator\">=</span><span class=\"token variable\">$ELEV</span> max_dist<span class=\"token operator\">=</span><span class=\"token variable\">$MAX_VIS_DIST</span> --v\n  COUNTER<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$((</span>COUNTER<span class=\"token operator\">+</span><span class=\"token number\">1</span><span class=\"token variable\">))</span></span>\n\n<span class=\"token keyword\">done</span> <span class=\"token operator\">&lt;</span> <span class=\"token variable\">$PTS_FILE</span></code></pre></div>\n<p>We begin by creating a variable, <code class=\"language-text\">COUNTER</code>, to store our progress through an iteration. Then we start looping. That’s actually a bit hard to comprehend, so I’ll explain it closely:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token keyword\">while</span> <span class=\"token function\">read</span> -r line\n  <span class=\"token keyword\">do</span>\n  <span class=\"token comment\"># do something</span>\n<span class=\"token keyword\">done</span> <span class=\"token operator\">&lt;</span> <span class=\"token variable\">$PTS_FILE</span></code></pre></div>\n<p>Notice that before this point, <code class=\"language-text\">line</code> didn’t exist. <code class=\"language-text\">line</code> is actually being defined on the last line of the loop syntax: <code class=\"language-text\">done &lt; $PTS_FILE</code> pipes the text file <code class=\"language-text\">$PTS_FILE</code>, representing a sequence of points along a line, into the for loop; each line of the file is then put into a variable called <code class=\"language-text\">$line</code> that we access during the execution of each loop.</p>\n<p>The first thing that gets done in the body of the loop is to return some information to the terminal, reporting on the progress of the loop. See if you now understand enough about <code class=\"language-text\">bc</code> to see how <code class=\"language-text\">PCT_FLOAT</code> is the progress of the loop expressed as a percentage value of floating point precision. <code class=\"language-text\">PCT</code> stores the result rounded to one decimal place.</p>\n<h3>GRASS regions</h3>\n<p>Next up, we use a bit of black magic to speed up the processing. GRASS uses the concept of “regions” when running calculations. Every command will consider the current region, and nothing will be done outside of that region. So if you’re calculating a viewshed (a very expensive procedure), and you know the maximum distance that you consider viewable from any point, you can tell GRASS that its region can be as small as that area. Annotated code:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token comment\"># Set the region to a smaller subset around the current observer point to speed processing</span>\n<span class=\"token comment\"># Note that this assumes the source line feature is projected in metres</span>\nx<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> $line <span class=\"token operator\">|</span> <span class=\"token function\">cut</span> -f1 -d,<span class=\"token variable\">)</span></span> <span class=\"token comment\"># Get the x coordinate value from line, the current observer point</span>\ny<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> $line <span class=\"token operator\">|</span> <span class=\"token function\">cut</span> -f2 -d,<span class=\"token variable\">)</span></span> <span class=\"token comment\"># The corresponding y value</span></code></pre></div>\n<p>Try <code class=\"language-text\">cut --help</code> coupled with the clue that <code class=\"language-text\">$line</code> is comma-delimited, if you don’t understand this.</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">W<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$x</span>-<span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span> <span class=\"token comment\"># x minus the maximum visible distance: the western reach of the region</span>\nE<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$x</span>+<span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span> <span class=\"token comment\"># x + MAX_VIS_DIST: eastern reach</span>\nN<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$y</span>+<span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span> <span class=\"token comment\"># y + MAX_VIS_DIST: northern reach</span>\nS<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span><span class=\"token keyword\">echo</span> <span class=\"token string\">\"<span class=\"token variable\">$y</span>-<span class=\"token variable\">$MAX_VIS_DIST</span>\"</span> <span class=\"token operator\">|</span> <span class=\"token function\">bc</span> -l<span class=\"token variable\">)</span></span> <span class=\"token comment\"># y - MAX_VIS_DIST: southern reach</span></code></pre></div>\n<p>Finally, we use this command to actually set the region in each iteration: <code class=\"language-text\">g.region n=$N s=$S e=$E w=$W</code>. I found that resetting the region each loop was remarkably faster than leaving the region equal to the union of all inputs.</p>\n<p>The final section of the loop performs the following:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">r.los input<span class=\"token operator\">=</span>dem output<span class=\"token operator\">=</span>tmp_los_<span class=\"token variable\">${COUNTER}</span> coordinate<span class=\"token operator\">=</span><span class=\"token variable\">$line</span> obs_elev<span class=\"token operator\">=</span><span class=\"token variable\">$ELEV</span> max_dist<span class=\"token operator\">=</span><span class=\"token variable\">$MAX_VIS_DIST</span> --v\nCOUNTER<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$((</span>COUNTER<span class=\"token operator\">+</span><span class=\"token number\">1</span><span class=\"token variable\">))</span></span></code></pre></div>\n<p><code class=\"language-text\">r.los</code> is the command that we’re really here for. It takes an input DEM, outputs a raster named <code class=\"language-text\">tmp_los_</code> plus whatever the counter is up to, a point value (our <code class=\"language-text\">$line</code> variable), and the observer elevation… and it goes away and tells us what that observer can see. Well, not really <em>what</em> they can see, more <em>where</em> they can see. The “what” can come later with some more Spatial Science™. For now, we close the loop and give it its input to set it in motion: <code class=\"language-text\">done &lt; $PTS_FILE</code>.</p>\n<h3>One Viewshed To Rule Them All</h3>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token comment\"># Set computational region to full extent</span>\ng.region -pm rast<span class=\"token operator\">=</span>dem --verbose\n\n<span class=\"token comment\"># Combine results in a single map</span>\n<span class=\"token comment\">#   (aggregation method doesn't matter as we use</span>\n<span class=\"token comment\">#   this as a boolean mask)</span>\n<span class=\"token keyword\">echo</span> <span class=\"token string\">\"\\nCombining component viewsheds\\n\"</span>\n<span class=\"token comment\"># Loops because otherwise can easily exceed default hard limit of number of</span>\n<span class=\"token comment\">#   rasters that can be open at once (1024)</span>\n<span class=\"token keyword\">for</span> i <span class=\"token keyword\">in</span> <span class=\"token variable\"><span class=\"token variable\">`</span><span class=\"token function\">seq</span> 0 99<span class=\"token variable\">`</span></span><span class=\"token punctuation\">;</span>\n<span class=\"token keyword\">do</span>\n  <span class=\"token comment\"># Combine a subset of all the viewsheds</span>\n  <span class=\"token comment\"># * is a wildcard for zero or more characters</span>\n  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">[</span> <span class=\"token variable\">$i</span> -le 9 <span class=\"token punctuation\">]</span> <span class=\"token comment\"># If i &lt;= 9</span>\n  <span class=\"token keyword\">then</span> <span class=\"token comment\"># append a 0 to the start of $i</span>\n    PATT<span class=\"token operator\">=</span>tmp_los_*0<span class=\"token variable\">$i</span>\n    OUT<span class=\"token operator\">=</span>total_los_0<span class=\"token variable\">$i</span>\n  <span class=\"token keyword\">else</span> <span class=\"token comment\"># don't modify the pattern of $i</span>\n    PATT<span class=\"token operator\">=</span>tmp_los_*<span class=\"token variable\">$i</span>\n    OUT<span class=\"token operator\">=</span>total_los_<span class=\"token variable\">$i</span>\n  <span class=\"token keyword\">fi</span>\n  r.series in<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">`</span>g.mlist --q type<span class=\"token operator\">=</span>rast pattern<span class=\"token operator\">=</span>$PATT sep<span class=\"token operator\">=</span>,<span class=\"token variable\">`</span></span> out<span class=\"token operator\">=</span><span class=\"token variable\">$OUT</span> method<span class=\"token operator\">=</span>sum --o --q\n<span class=\"token keyword\">done</span></code></pre></div>\n<p>Now that we have created each of the viewsheds for each of the points we sampled along the road or train line, we want to combine these individual raster layers into a single raster layer.</p>\n<p>There is considerable scope for interesting complexity here. For instance, you could combine the results additively, thereby building a surface where each cell has a value from 0 (never seen) to a potentially very large number (seen from many of the points along the route). If you assume that the train travels at a constant speed, this surface would tell you how long you spend looking at any given 25x25 metre grid cell. You could then use this to determine what type of forest you spend more time looking at: native or exotic.</p>\n<p>I’m going for an easy option: not worrying about how the layers are combined. I want a simple Boolean surface: can a cell be seen at any point in the trip, or can it never be seen? There’s no room for ambiguity, and the result is not as useful as the rest of the code allows it to be. But, I don’t have a “real” application for this to matter. If you want to fork the repository again on Github and explore this for yourself, go right ahead!</p>\n<p>First, we use <code class=\"language-text\">g.region</code> to reset the region to the full extent of our input raster layer. Recall that without this command, the region would be stuck at whatever it was in the last iteration of the preceding loop!</p>\n<p>Then (after some comments and printing information to stdout) we enter a loop that seems a little unnecessary. If we’re combining a bunch of raster layers together all at once, why do we need a loop? The answer is because GRASS 6.4 does not like it if you try and open more than 1024 rasters at any one time. As we would have made thousands of new rasters by this point, we cannot actually combine them all at once; rather we have to do it gingerly, in stages.</p>\n<p>Therefore the pseudo-code is to:</p>\n<ol>\n<li>\n<p>Start a loop from 0 to 99</p>\n</li>\n<li>\n<p>Get the value of the iterator in the style of 00, 01, 02, …, 98, 99 (i.e. a leading zero for numbers less than 10).</p>\n</li>\n<li>\n<p>Create a pattern variable (<code class=\"language-text\">PATT</code>) to store the pattern that our input point-specific viewshed rasters follow if their filename ends with 01, or 02, or whatever the iterator is at. (This will allow us to process roughly 1% of the input rasters in each step.)</p>\n</li>\n<li>\n<p>Perform the actual combination for a subset of the layers matching <code class=\"language-text\">PATT</code>.</p>\n</li>\n</ol>\n<p><code class=\"language-text\">r.series</code> is the key command of the above codeblock. It takes as its <code class=\"language-text\">in</code> parameter a list of layers that is constructed by a second command, <code class=\"language-text\">g.mlist</code>.</p>\n<p><code class=\"language-text\">.g.mlist</code> is a <strong>very</strong> handy GRASS command. Take a look at its description in its help:</p>\n<blockquote>\n<p>Lists available GRASS data base files of the user-specified data type optionally using the search pattern.</p>\n</blockquote>\n<p>So when we want to combine only a fraction of our intermediate viewshed rasters at one time, we tell <code class=\"language-text\">g.mlist</code> to go away and find all layers that match a particular pattern (e.g. all rasters called <code class=\"language-text\">&quot;name_\\*00&quot;</code>, where * is a wildcard—that is, all of our intermediate layers ending in “00”). <code class=\"language-text\">r.series</code> then takes this list of layers and combines them with the <code class=\"language-text\">method</code> we have specified. (I used <code class=\"language-text\">sum</code>, although as I said I actually ignore this.)</p>\n<p>What we’re then left with is a series of 99 raster layers, each representing a small part of what will become our finished product.{% sidenote ‘sn-id-realisation’ “I realise now that it would be smarter to combine the intermediate layer with the pattern-match layers as part of the above loop… but at the price of one additional <code class=\"language-text\">r.series</code> it ain’t the end of the world.” %}</p>\n<p>So, combine these up into our finished product with another pattern matching exercise:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">r.series in<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">`</span>g.mlist --q type<span class=\"token operator\">=</span>rast pattern<span class=\"token operator\">=</span>total_los_* sep<span class=\"token operator\">=</span>,<span class=\"token variable\">`</span></span> out<span class=\"token operator\">=</span>total_los method<span class=\"token operator\">=</span>sum --o --q</code></pre></div>\n<p>You could display the result now if you wanted the map to represent the number of times each cell has been determined as being “viewable”. I actually like the idea of a binary (viewable/not viewable) surface, where shading can be used to indicate distance from the line feature. So that’s what I’ll do. However it may be a little misleading, as distance from the line feature used in the exercise is not technically synonymous with the minimum distance from which it can be seen!</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token comment\"># Create distance to line_feature map</span>\n<span class=\"token keyword\">echo</span> <span class=\"token string\">\"\\nDetermining distance from features\\n\"</span>\nv.to.rast in<span class=\"token operator\">=</span>line_feature out<span class=\"token operator\">=</span>line_feature use<span class=\"token operator\">=</span>val val<span class=\"token operator\">=</span>1 --o --q\nr.grow.distance -m input<span class=\"token operator\">=</span>line_feature distance<span class=\"token operator\">=</span>dist_from_line_feature --o --q</code></pre></div>\n<p>This takes our line feature input and turns it into a raster; it then “grows” (raster buffers) this line… how far? To the same size as the entire GRASS region. There is no need to tell GRASS that; and it stores the output surface as a dataset specified by the rather misleading title of <code class=\"language-text\">distance</code>.</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token comment\"># Use distance to line_feature instead of sum of times seen in the result map</span>\n<span class=\"token keyword\">echo</span> <span class=\"token string\">\"\\nSubstituting number of times seen for distance to cell from line\\n\"</span>\nr.mapcalc <span class=\"token string\">\"<span class=\"token variable\">$OUTFILE</span> = if(total_los, dist_from_line_feature, null())\"</span> --o --v</code></pre></div>\n<p>Here we use a bit of raster calculation (otherwise known as image manipulation) to make a new layer. To put the if statement into human terms: “if there is a  non-null value of <code class=\"language-text\">total_los</code> (i.e. a cell has been identified as visible), substitute its value with the value of the equivalent cell from the layer <code class=\"language-text\">dist_from_line_feature</code> (a raster surface where each cell knows its minimum distance from the line feature), otherwise make its value null.</p>\n<p>The rest should be self-explanatory:</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token comment\"># Write output (as geotiff)</span>\nr.out.gdal input<span class=\"token operator\">=</span><span class=\"token variable\">$OUTFILE</span> output<span class=\"token operator\">=</span><span class=\"token punctuation\">..</span>/data/output/<span class=\"token variable\">$OUTFILE</span>.tif format<span class=\"token operator\">=</span>GTiff --o --v\n\n<span class=\"token comment\"># Clean up, removing the component visibility rasters, only after outputs have been written</span>\n<span class=\"token keyword\">echo</span> <span class=\"token string\">\"\\nDeleting temporary files\\n\"</span>\ng.mremove -f <span class=\"token string\">\"tmp_los_*\"</span> --q\ng.mremove -f <span class=\"token string\">\"total_los_*\"</span> --q\n\n<span class=\"token keyword\">echo</span> <span class=\"token string\">\"\\ngenerate_los.sh complete\\n\"</span></code></pre></div>\n<p>The final output is simply a GeoTiff. Try opening it in QGIS if you have been playing along at home. If you’re just reading, then in the <a href=\"http://www.nearimprov.com/train-landscapes\">interactive map</a>, the output GeoTiff is the special coloured layer you see on top of the basemap.</p>\n<p>So how do we get to this next stage?</p>\n<h1>Making Mapnik tiles with QTiles</h1>\n<p>There are a variety of ways to make map tiles.{% sidenote “sn-id-tiles” “Don’t know what tiles are? That’s OK, everyone had to find out at some point. I really liked <a href=\"http://lyzidiamond.com/leaflet/#0\">this introduction</a> by <a href=\"https://twitter.com/lyzidiamond\">Lyzi Diamond</a>.” %} The simplest method for constructing map tiles, in my opinion, is to use a QGIS plugin called <a href=\"https://github.com/nextgis/QTiles\">QTiles</a>. You can control all your styling and extents with QGIS layers, and then just tell the plugin to go away and make your map tiles.</p>\n<p>To find out how to install a QGIS plugin, look <a href=\"http://www.qgistutorials.com/en/docs/using_plugins.html\">here</a>.</p>\n<p>The process for our purposes is rather simple.</p>\n<ol>\n<li>\n<p>The GRASS script spits out a GeoTiff.</p>\n</li>\n<li>\n<p>You add that to a QGIS project via the add raster layer button.</p>\n</li>\n<li>\n<p>The GRASS script also had access to a vector line feature (as well as creating a CSV point dataset from that). You can add one or both of these via the add vector layer button.</p>\n</li>\n<li>\n<p>To add context, add a pre-existing baselayer, or make your own. For example, you could create a colour relief map (hypsometric tint). <a href=\"https://www.mapbox.com/tilemill/docs/guides/terrain-data/\">Mapbox has a good tutorial using more command line GIS</a>, this time GDAL. I just took the easy route (again), and went for a Web Mapping Service (<a href=\"https://data.linz.govt.nz/p/web-services/\">WMS</a>) from the good folk at Landcare Research. Look for the add data button in the sidebar with the tooltip “Add WMS/WMST Layer”. When it opens, create a new connection using the URL to the Landcare Research WMS: <code class=\"language-text\">http://maps.scinfo.org.nz/basemaps/wms?</code>. There are a variety of layers you can add (see image); the one I used is called the “Landcover Terrain Map”.</p>\n</li>\n<li>\n<p>Once you’ve added this basemap, styled and ordered your layers and are happy with the appearance of your map, install QTiles and fire it up via the menu Plugins > QTiles > QTiles. See the second image below for example parameters. Just be cautious before going ahead with your settings: you are generating exponentially more tiles (i.e. PNG images) for each additional level of zoom (1 is the most zoomed out, 18 is the most zoomed in). I only generated tiles between zoom levels 7 and 13, because I knew I was going to restrict the user to these zoom levels in the end. Allow the tool to run, and you’re ready to make a web map.</p>\n</li>\n</ol>\n<br>\n{% fullwidth \"./assets/LR-example.png\" \"Screenshot from QGIS 2.8, of the Landcare Research WMS.\" %}\n<br>\n{% fullwidth \"./assets/qtiles.png\" \"Screenshot from QGIS 2.8, QTiles plugin.\" %}\n<h1>Making a web-ready map with Leaflet</h1>\n<p>There are lots of good tutorials on making webmaps, and I encourage you to explore them. I don’t consider myself very good at making them (yet). This is a very simple example, using two tile datasets and allowing the user to switch between them.</p>\n<p>First, let’s look at the HTML: the webpage that will contain our map. (The map itself is made in a JavaScript script.) The HTML is divided into the <code class=\"language-text\">head</code> and the <code class=\"language-text\">body</code>.</p>\n<p>The head:</p>\n<div class=\"gatsby-highlight\" data-language=\"html\"><pre class=\"language-html\"><code class=\"language-html\"><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>head</span><span class=\"token punctuation\">></span></span>\n  <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>meta</span> <span class=\"token attr-name\">charset</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>utf-8<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n  <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>meta</span> <span class=\"token attr-name\">http-equiv</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>X-UA-Compatible<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">content</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>IE=edge<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n\n  <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>meta</span> <span class=\"token attr-name\">name</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>viewport<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">content</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>width=device-width, initial-scale=1.0<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n\n  <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>link</span> <span class=\"token attr-name\">rel</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>stylesheet<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">href</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>http://cdn.leafletjs.com/leaflet-0.7.3/leaflet.css<span class=\"token punctuation\">\"</span></span> <span class=\"token punctuation\">/></span></span>\n  <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>link</span> <span class=\"token attr-name\">rel</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>stylesheet<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">href</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>./source/style.css<span class=\"token punctuation\">\"</span></span> <span class=\"token punctuation\">/></span></span>\n\n  <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>meta</span> <span class=\"token attr-name\">http-equiv</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>Content-type<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">content</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>text/html; charset=utf-8<span class=\"token punctuation\">\"</span></span> <span class=\"token punctuation\">/></span></span>\n<span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>head</span><span class=\"token punctuation\">></span></span></code></pre></div>\n<p>This is all pretty standard, if you’ve ever hit “View Page Source” on a webpage. Can you see where we tell the page to read the Leaflet CSS (<code class=\"language-text\">leaflet.css</code>)? And a custom bit of CSS (<code class=\"language-text\">style.css</code>)?</p>\n<p>Now for the body:</p>\n<div class=\"gatsby-highlight\" data-language=\"html\"><pre class=\"language-html\"><code class=\"language-html\"><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>body</span><span class=\"token punctuation\">></span></span>\n    <span class=\"token comment\">&lt;!-- header div --></span>\n    <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>div</span> <span class=\"token attr-name\">id</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>title-text<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n      <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>h2</span><span class=\"token punctuation\">></span></span>\n        Travelling overland between Auckland and Wellington: what can you see?\n      <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>h2</span><span class=\"token punctuation\">></span></span>\n    <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>div</span><span class=\"token punctuation\">></span></span>\n    <span class=\"token comment\">&lt;!-- map div --></span>\n    <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>div</span> <span class=\"token attr-name\">id</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>map<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>div</span><span class=\"token punctuation\">></span></span>\n    <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>script</span> <span class=\"token attr-name\">src</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>http://cdn.leafletjs.com/leaflet-0.7.3/leaflet.js<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span><span class=\"token script language-javascript\"></span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>script</span><span class=\"token punctuation\">></span></span>\n    <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>script</span> <span class=\"token attr-name\">src</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>./source/make_map.js<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">type</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>text/javascript<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span><span class=\"token script language-javascript\"></span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>script</span><span class=\"token punctuation\">></span></span>\n<span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>body</span><span class=\"token punctuation\">></span></span></code></pre></div>\n<p>We have two <code class=\"language-text\">div</code> elements in the body, and two scripts. The first <code class=\"language-text\">div</code> contains the header text you see at the top of the map. The second <code class=\"language-text\">div</code>, with the ID of <code class=\"language-text\">&quot;map&quot;</code>, contains our map, although there is very little indication yet that it actually does anything. The clue lies in the two pieces of JavaScript that get loaded next. The first is the standard Leaflet JavaScript that brings along the functionality of every Leaflet slippy map you’ve ever seen. The second is a custom bit of code where we specify our own special map. This bit of code is in the Github respository, and is called <code class=\"language-text\">make_map.js</code>. Let’s take a look at that next.</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">var</span>  carViewshed <span class=\"token operator\">=</span> <span class=\"token string\">'https://s3-ap-southeast-2.amazonaws.com/train-landscapes/car/{z}/{x}/{y}.png'</span><span class=\"token punctuation\">,</span>\n    trainViewshed <span class=\"token operator\">=</span> <span class=\"token string\">'https://s3-ap-southeast-2.amazonaws.com/train-landscapes/rail/Mapnik/{z}/{x}/{y}.png'</span><span class=\"token punctuation\">,</span>\n    southWest <span class=\"token operator\">=</span> <span class=\"token punctuation\">[</span><span class=\"token operator\">-</span><span class=\"token number\">41.722</span><span class=\"token punctuation\">,</span><span class=\"token number\">171.748</span><span class=\"token punctuation\">]</span><span class=\"token punctuation\">,</span>\n    northEast <span class=\"token operator\">=</span> <span class=\"token punctuation\">[</span><span class=\"token operator\">-</span><span class=\"token number\">36.441</span><span class=\"token punctuation\">,</span><span class=\"token number\">179.124</span><span class=\"token punctuation\">]</span><span class=\"token punctuation\">,</span>\n    bounds <span class=\"token operator\">=</span> <span class=\"token punctuation\">[</span>southWest<span class=\"token punctuation\">,</span> northEast<span class=\"token punctuation\">]</span><span class=\"token punctuation\">,</span>\n    attribution <span class=\"token operator\">=</span> <span class=\"token string\">'Richard Law | \\\n    Pierre Roudier | \\\n    Basemap © &lt;a href=\"http://maps.scinfo.org.nz/\">Landcare Research&lt;/a> 2014. Contains data sourced from LINZ. Crown Copyright Reserved. &lt;a href=\"http://creativecommons.org/licenses/by/3.0/nz/\">CC BY 3.0 NZ&lt;/a> | \\\n    &lt;a href=\"https://koordinates.com/layer/40-nz-road-centrelines-topo-150k/\">LINZ&lt;/a> &lt;a href=\"http://creativecommons.org/licenses/by/3.0/nz/\">CC BY 3.0 NZ&lt;/a> | \\\n    &lt;a href=\"http://grass.osgeo.org/\">GRASS GIS&lt;/a>'</span><span class=\"token punctuation\">,</span>\n    global_min_zoom <span class=\"token operator\">=</span> <span class=\"token number\">7</span><span class=\"token punctuation\">,</span>\n    global_max_zoom <span class=\"token operator\">=</span> <span class=\"token number\">13</span><span class=\"token punctuation\">;</span>\n\n<span class=\"token keyword\">var</span> map <span class=\"token operator\">=</span> <span class=\"token keyword\">new</span> <span class=\"token class-name\">L<span class=\"token punctuation\">.</span>Map</span><span class=\"token punctuation\">(</span><span class=\"token string\">'map'</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\nmap<span class=\"token punctuation\">.</span><span class=\"token function\">setView</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">[</span><span class=\"token operator\">-</span><span class=\"token number\">38.6875</span><span class=\"token punctuation\">,</span> <span class=\"token number\">176.0694</span><span class=\"token punctuation\">]</span><span class=\"token punctuation\">,</span> <span class=\"token number\">7</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span> <span class=\"token comment\">//centre and zoom of map, initially</span>\nmap<span class=\"token punctuation\">.</span><span class=\"token function\">setMaxBounds</span><span class=\"token punctuation\">(</span>bounds<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\nmap<span class=\"token punctuation\">.</span>options<span class=\"token punctuation\">.</span>minZoom <span class=\"token operator\">=</span> global_min_zoom<span class=\"token punctuation\">;</span>\nmap<span class=\"token punctuation\">.</span>options<span class=\"token punctuation\">.</span>maxZoom <span class=\"token operator\">=</span> global_max_zoom<span class=\"token punctuation\">;</span>\n\n<span class=\"token keyword\">var</span> car <span class=\"token operator\">=</span> <span class=\"token constant\">L</span><span class=\"token punctuation\">.</span><span class=\"token function\">tileLayer</span><span class=\"token punctuation\">(</span>carViewshed<span class=\"token punctuation\">,</span> <span class=\"token punctuation\">{</span>\n  attribution<span class=\"token punctuation\">:</span> attribution<span class=\"token punctuation\">,</span>\n  bounds<span class=\"token punctuation\">:</span> bounds<span class=\"token punctuation\">,</span>\n  minZoom<span class=\"token punctuation\">:</span> global_min_zoom<span class=\"token punctuation\">,</span>\n  maxZoom<span class=\"token punctuation\">:</span> global_max_zoom<span class=\"token punctuation\">,</span>\n  tms<span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">,</span>\n  isBaseLayer<span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">,</span>\n  <span class=\"token comment\">//opacity: 0.7,</span>\n  <span class=\"token comment\">//transparent: true</span>\n<span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span><span class=\"token function\">addTo</span><span class=\"token punctuation\">(</span>map<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span> <span class=\"token comment\">//default layer, so add to map</span>\n\n<span class=\"token keyword\">var</span> train <span class=\"token operator\">=</span> <span class=\"token constant\">L</span><span class=\"token punctuation\">.</span><span class=\"token function\">tileLayer</span><span class=\"token punctuation\">(</span>trainViewshed<span class=\"token punctuation\">,</span> <span class=\"token punctuation\">{</span>\n  attribution<span class=\"token punctuation\">:</span> attribution<span class=\"token punctuation\">,</span>\n  bounds<span class=\"token punctuation\">:</span> bounds<span class=\"token punctuation\">,</span>\n  minZoom<span class=\"token punctuation\">:</span> global_min_zoom<span class=\"token punctuation\">,</span>\n  maxZoom<span class=\"token punctuation\">:</span> global_max_zoom<span class=\"token punctuation\">,</span>\n  tms<span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">,</span>\n  isBaseLayer<span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">,</span>\n  <span class=\"token comment\">//opacity: 0.7,</span>\n  <span class=\"token comment\">//transparent: true</span>\n<span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span> <span class=\"token comment\">//non-default layer, so don't add to map</span>\n\n<span class=\"token keyword\">var</span> viewshedBasemaps <span class=\"token operator\">=</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token string\">\"Car/bus view\"</span><span class=\"token punctuation\">:</span> car<span class=\"token punctuation\">,</span>\n    <span class=\"token string\">\"Overlander view\"</span><span class=\"token punctuation\">:</span> train\n<span class=\"token punctuation\">}</span><span class=\"token punctuation\">;</span>\n\n<span class=\"token constant\">L</span><span class=\"token punctuation\">.</span>control<span class=\"token punctuation\">.</span><span class=\"token function\">layers</span><span class=\"token punctuation\">(</span>viewshedBasemaps<span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span><span class=\"token function\">addTo</span><span class=\"token punctuation\">(</span>map<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span> <span class=\"token comment\">// Add the layer control to the map</span></code></pre></div>\n<p>The first unbroken section of code above creates a bunch of variables. While the <code class=\"language-text\">var</code> keyword is only used once, it could be used on each line if the commas at the end were omitted. <code class=\"language-text\">carViewshed</code> and <code class=\"language-text\">trainViewshed</code> are the relative paths to the hosted folders that contain the tiles we made earlier with QTiles. (I’ll explain the Amazon business soon.) <code class=\"language-text\">southWest</code> and <code class=\"language-text\">northEast</code> are global parameters that I use to constrain the user’s ability to move: I only want them to be able to scroll around the North Island… mostly because that’s the only place I’ve actually created any map. The variables <code class=\"language-text\">attribution</code>, if you’re paying attention, is the bit of text you see at the bottom of the map. Leaflet is good about using that, and so should you be.</p>\n<p>Notice that <code class=\"language-text\">global_max_zoom</code> and <code class=\"language-text\">global_min_zoom</code> correspond to the numbers I used in the tile generation step. I didn’t make tiles beyond the range 7-13, so I don’t let the user zoom beyond that range (otherwise they’d see nothing).</p>\n<p>I then make a very important variable, <code class=\"language-text\">map</code>, and set a few of its options:</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">var</span> map <span class=\"token operator\">=</span> <span class=\"token keyword\">new</span> <span class=\"token class-name\">L<span class=\"token punctuation\">.</span>Map</span><span class=\"token punctuation\">(</span><span class=\"token string\">'map'</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\nmap<span class=\"token punctuation\">.</span><span class=\"token function\">setView</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">[</span><span class=\"token operator\">-</span><span class=\"token number\">38.6875</span><span class=\"token punctuation\">,</span> <span class=\"token number\">176.0694</span><span class=\"token punctuation\">]</span><span class=\"token punctuation\">,</span> <span class=\"token number\">7</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span> <span class=\"token comment\">//centre and zoom of map, initially</span>\nmap<span class=\"token punctuation\">.</span><span class=\"token function\">setMaxBounds</span><span class=\"token punctuation\">(</span>bounds<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\nmap<span class=\"token punctuation\">.</span>options<span class=\"token punctuation\">.</span>minZoom <span class=\"token operator\">=</span> global_min_zoom<span class=\"token punctuation\">;</span>\nmap<span class=\"token punctuation\">.</span>options<span class=\"token punctuation\">.</span>maxZoom <span class=\"token operator\">=</span> global_max_zoom<span class=\"token punctuation\">;</span></code></pre></div>\n<p>Later, we will call on this <code class=\"language-text\">map</code> to actually display (you guessed it) a map.</p>\n<p>But first, I need to tell it what it’s allowed to display.</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">var</span> car <span class=\"token operator\">=</span> <span class=\"token constant\">L</span><span class=\"token punctuation\">.</span><span class=\"token function\">tileLayer</span><span class=\"token punctuation\">(</span>carViewshed<span class=\"token punctuation\">,</span> <span class=\"token punctuation\">{</span>\n  attribution<span class=\"token punctuation\">:</span> attribution<span class=\"token punctuation\">,</span>\n  bounds<span class=\"token punctuation\">:</span> bounds<span class=\"token punctuation\">,</span>\n  minZoom<span class=\"token punctuation\">:</span> global_min_zoom<span class=\"token punctuation\">,</span>\n  maxZoom<span class=\"token punctuation\">:</span> global_max_zoom<span class=\"token punctuation\">,</span>\n  tms<span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">,</span>\n  isBaseLayer<span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">,</span>\n  <span class=\"token comment\">//opacity: 0.7,</span>\n  <span class=\"token comment\">//transparent: true</span>\n<span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span><span class=\"token function\">addTo</span><span class=\"token punctuation\">(</span>map<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span> <span class=\"token comment\">//default layer, so add to map</span>\n\n<span class=\"token keyword\">var</span> train <span class=\"token operator\">=</span> <span class=\"token constant\">L</span><span class=\"token punctuation\">.</span><span class=\"token function\">tileLayer</span><span class=\"token punctuation\">(</span>trainViewshed<span class=\"token punctuation\">,</span> <span class=\"token punctuation\">{</span>\n  attribution<span class=\"token punctuation\">:</span> attribution<span class=\"token punctuation\">,</span>\n  bounds<span class=\"token punctuation\">:</span> bounds<span class=\"token punctuation\">,</span>\n  minZoom<span class=\"token punctuation\">:</span> global_min_zoom<span class=\"token punctuation\">,</span>\n  maxZoom<span class=\"token punctuation\">:</span> global_max_zoom<span class=\"token punctuation\">,</span>\n  tms<span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">,</span>\n  isBaseLayer<span class=\"token punctuation\">:</span> <span class=\"token boolean\">true</span><span class=\"token punctuation\">,</span>\n  <span class=\"token comment\">//opacity: 0.7,</span>\n  <span class=\"token comment\">//transparent: true</span>\n<span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span> <span class=\"token comment\">//non-default layer, so don't add to map</span></code></pre></div>\n<p>I made two tile datasets, for the view from the car and from the train. The syntax for accessing them is naturally quite similar. There are more settings I didn’t play with, and I even commented out two that didn’t work very well after some experimentation.</p>\n<p>Without this next block of code, the map would function, but you would never be able to get to the <code class=\"language-text\">train</code> tiles. So we add a controller to allow a user to switch between our two sets of map tiles:</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">var</span> viewshedBasemaps <span class=\"token operator\">=</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token string\">\"Car/bus view\"</span><span class=\"token punctuation\">:</span> car<span class=\"token punctuation\">,</span>\n    <span class=\"token string\">\"Overlander view\"</span><span class=\"token punctuation\">:</span> train\n<span class=\"token punctuation\">}</span><span class=\"token punctuation\">;</span>\n\n<span class=\"token constant\">L</span><span class=\"token punctuation\">.</span>control<span class=\"token punctuation\">.</span><span class=\"token function\">layers</span><span class=\"token punctuation\">(</span>viewshedBasemaps<span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span><span class=\"token function\">addTo</span><span class=\"token punctuation\">(</span>map<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span> <span class=\"token comment\">// Add the layer control to the map</span></code></pre></div>\n<p><code class=\"language-text\">L</code> refers to Leaflet, and I nutted out this bit of code by reading their excellent documentation. Note that <code class=\"language-text\">car</code> and <code class=\"language-text\">train</code> here are the <code class=\"language-text\">L.tileLayer</code> variables we just defined. We tell Leaflet that we have two tile layers that we want to add to its set of <code class=\"language-text\">control.layers</code>.</p>\n<p>The final bit of work is to add some CSS. Stepping through the below code, we have the style for:</p>\n<ol>\n<li>The webpage as a whole.</li>\n<li>The title text you see at the top of the webpage.</li>\n<li>The “map” <code class=\"language-text\">div</code>.</li>\n<li>The container of the leaflet map, which I have made transparent so that it is white like the rest of the page background.</li>\n<li>A style for the layer control so it pops more than the default. I wanted to emphasise the layer selector, as it is really the entire point of making contrasting viewsheds. This bit of CSS is a little complex; the best way to work it out is to fiddle with it.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"css\"><pre class=\"language-css\"><code class=\"language-css\"><span class=\"token selector\">html, body</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token property\">height</span><span class=\"token punctuation\">:</span> 100%<span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n\n<span class=\"token selector\">#title-text</span><span class=\"token punctuation\">{</span>\n  <span class=\"token property\">height</span><span class=\"token punctuation\">:</span> 8%<span class=\"token punctuation\">;</span>\n  <span class=\"token property\">width</span><span class=\"token punctuation\">:</span> 100%<span class=\"token punctuation\">;</span>\n  <span class=\"token property\">font-family</span><span class=\"token punctuation\">:</span> Helvetica<span class=\"token punctuation\">;</span>\n  <span class=\"token property\">text-align</span><span class=\"token punctuation\">:</span> center<span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n\n<span class=\"token selector\">#map</span><span class=\"token punctuation\">{</span>\n   <span class=\"token property\">height</span><span class=\"token punctuation\">:</span> 89%<span class=\"token punctuation\">;</span>\n   <span class=\"token property\">width</span><span class=\"token punctuation\">:</span> 100%<span class=\"token punctuation\">;</span>\n   <span class=\"token punctuation\">}</span>\n\n<span class=\"token comment\">/* background of leaflet container: transparent \\*/</span>\n<span class=\"token selector\">.leaflet-container</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token property\">background-color</span><span class=\"token punctuation\">:</span><span class=\"token function\">rgba</span><span class=\"token punctuation\">(</span>255,0,0,0.0<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n\n<span class=\"token comment\">/* custom style for the layer control to make it a bit more obvious \\*/</span>\n<span class=\"token selector\">.leaflet-control-layers-toggle:after</span><span class=\"token punctuation\">{</span>\n    <span class=\"token property\">content</span><span class=\"token punctuation\">:</span><span class=\"token string\">\"Toggle transport mode\"</span><span class=\"token punctuation\">;</span>\n    <span class=\"token property\">color</span><span class=\"token punctuation\">:</span>#000 <span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n<span class=\"token selector\">.leaflet-control-layers-toggle</span><span class=\"token punctuation\">{</span>\n    <span class=\"token property\">width</span><span class=\"token punctuation\">:</span>auto<span class=\"token punctuation\">;</span>\n    <span class=\"token property\">background-position</span><span class=\"token punctuation\">:</span>10px 50% <span class=\"token punctuation\">;</span>\n    <span class=\"token property\">padding</span><span class=\"token punctuation\">:</span>6px<span class=\"token punctuation\">;</span>\n    <span class=\"token property\">padding-left</span><span class=\"token punctuation\">:</span>40px<span class=\"token punctuation\">;</span>\n    <span class=\"token property\">padding-right</span><span class=\"token punctuation\">:</span>10px<span class=\"token punctuation\">;</span>\n    <span class=\"token property\">text-decoration</span><span class=\"token punctuation\">:</span>none<span class=\"token punctuation\">;</span>\n    <span class=\"token property\">line-height</span><span class=\"token punctuation\">:</span>36px<span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span></code></pre></div>\n<h1>Getting the map online</h1>\n<p>So, you have used a complex geographic routine to make a cool viewshed for the North Island of New Zealand. You have made a working web map and added some custom flair. How do you show it off? There are lots of ways to host webpages, but since we’re using Github, Github is actually a very good option for projects like these.</p>\n<p>In any Github project, if you make a branch called <code class=\"language-text\">gh-pages</code>, some magic happens. <a href=\"https://pages.github.com/\">Github is the authority on the matter</a>. Once you have your username.github.io repository ready, any <em>other</em> repository you make can have a hosted website simply by making a <code class=\"language-text\">gh-pages</code> branch.</p>\n<p>If this branch has an HTML file called <code class=\"language-text\">index.html</code>, you can then find your special Github-hosted webpage via the URL: <code class=\"language-text\">https://{username}.github.io/{repository}</code>. If this page happens to contain a map… then you have a map available on the Internet for the world to see, for free. You just have to be comfortable with the code (and often data) behind it being open to anyone.</p>\n<p>You can go one step further and also get a custom domain name, if you want to be able to link to something like <a href=\"https://www.nearimprov.com/train-landscapes\">https://www.nearimprov.com/train-landscapes</a>.</p>\n<h2>Amazon AWS</h2>\n<p>There’s just one little problem left. The two sets of tiles, even though they have a constrained range of zoom levels and geographic extent, come to about three gigabytes of images. Github doesn’t like that (I tried). So you need an alternative. Some kind of system where you can put lots of images in a directory structure on the Internet, and access them with a persistent URL. Amazon Web Services (AWS) is the cloud solution for you!</p>\n<p>If you sign up for an AWS account and navigate to your console, you should be able to see where you can create a “bucket”. Once you’ve made your bucket, you can then create folders just like any other directory. Then, inside each folder, you can store your tiles.</p>\n<br>\n{% fullwidth \"./assets/aws1.png\" %}\n<br>\n{% fullwidth \"./assets/aws2.png\" %}\n<p>There are two catches:</p>\n<ol>\n<li>\n<p>AWS is not free. Beyond a certain number of downloads you will be charged; I intend to monitor mine and remove the files before this happens.</p>\n</li>\n<li>\n<p>You need to programmatically upload your tiles, so you need to go back to that shell you love so well.</p>\n</li>\n</ol>\n<p>You need to install and configure <code class=\"language-text\">s3cmd</code>. On Ubuntu it’s in the official repositories, so it’s as easy as the command <code class=\"language-text\">sudo apt-get install s3cmd</code>. I have no idea how easy or difficult this is on other operating systems (I told you to use Linux!)</p>\n<p>If you’ve sorted your account through your web browser, you need to request your access keys from your management console. You’ll get given two of them, sent to you in a download that you keep to yourself. When you have these in front of you run <code class=\"language-text\">s3cmd --configure</code> at the command line and provide the keys when requested. I just used the default answers to all the other questions.</p>\n<p>Now if you have set up your bucket and two folders “car” and “rail”, you can sync your local tiles generated with QTiles to Amazon CloudFront. This is also a relatively easy command, just be aware how much bandwidth you’re using.</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">s3cmd <span class=\"token function\">sync</span> /path/to/car/tiles/ s3://bucket-name/car</code></pre></div>\n<p>Repeat the above with your other tile dataset. Refer back to the JavaScript to see how I the referred to the URLs where you can see these images. You can see an example tile <a href=\"https://s3-ap-southeast-2.amazonaws.com/train-landscapes/car/10/1007/381.png\">here</a>, while it lasts.</p>\n<br>\n{% fullwidth \"./assets/aws3.png\" %}\n<br>\n{% fullwidth \"./assets/aws4.png\" %}\n<h3>Local tiles</h3>\n<p>Obviously in order to put tiles on Amazon’s servers, you also need to have generated tiles locally. You can use these with Leaflet to preview your map offline. Simple substitute the URLs I used for carViewshed and trainViewshed with local paths, e.g.</p>\n<p>{% highlight js %}\nvar carViewshed = ‘/data/tiles/rail/Mapnik/{z}/{x}/{y}.png’\n{% endhighlight %}</p>\n<p>Then you can use Python from your command line to serve up a webpage (Python 2.x):</p>\n<p>{% highlight bash %}\npython -m SimpleHTTPServer\n{% endhighlight %}</p>\n<p>Check out <a href=\"http://localhost:8000/\">http://localhost:8000/</a> once this server is running. (Press ctrl-c to get back in control of your command line.)</p>\n<p>{% newthought “I’ve been frustrated many times in the past” %} by the need to patch together a series of tutorials from different authors to actually get my own project off the ground, from data to a finished product. I hope this has been helpful for you to realise something from your own imagination.</p>\n<p>If there’s any element that you feel needs better explanation, please leave a comment and I’ll help you out.</p>\n<p>Similarly, if there’s anything that you feel is a glaring mistake in my code, point it out, I’d love to improve. I’m sure I’m fallible: Pierre’s bash script was the first piece of bash that I’d ever read; my changes were my first experience with shell scripts. I’ve since found them very useful.</p>\n<p>Have fun!</p>","frontmatter":{"title":"The things you see on a journey","date":"11:07 PM, Monday June 01, 2015","updated":null}}},"pageContext":{"slug":"/things-you-see-on-a-journey/","previous":{"fields":{"slug":"/headway/"},"frontmatter":{"title":"What is a headway?","updated":null,"date":"2014-06-17T08:38:41","path":"/blog/2014-06-17-what-is-a-headway","tags":["transport","thesis"]}},"next":{"fields":{"slug":"/traffic-dashboard/"},"frontmatter":{"title":"NZ Traffic Dashboard","updated":null,"date":"2017-12-31T14:25:00.000Z","path":"/blog/nz-traffic-dashboard","tags":["portfolio","development","react","javascript","transport","New Zealand","NZTA"]}}}}