{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"4e38711b-8a2b-5b97-951f-51390095b4cd","excerpt":"Reading Whitcoulls, a major bookstore chain in New Zealand, decided to stop selling Jordan Petersen's book  12 Rules for Life  following the…","html":"<h1>Reading</h1>\n<p>Whitcoulls, a major bookstore chain in New Zealand, decided to stop selling Jordan Petersen's book <em>12 Rules for Life</em> following the tragic mosque attack in Christchurch. Does his book have some kind of anti-Islamic bent? No, it does not. It only mentions Islam once, and that mention is <em>positive</em>. The reason for the ban is because someone wearing an \"I'm a proud Islamaphobe\" t-shirt posed for a picture with Petersen. Which is an extremely tenuous link to justify the banning of this book, in my estimation. My mother-in-the-law, the loveliest peacenik old Catholic lady you could ever hope to meet, read his book and rated it highly. She's lent it to me. Although Whitcoulls later rescinded their ban, the Streisand effect bit me hard and so the book jumped to the top of my reading list—alongside a host of other unpopular opinions that I've curated for you this month. Find one you disagree with the most, and read it. Contrary opinions, like vegetables, are good for your critical thought faculty. This is something the age of social media is depriving us.</p>\n<ul>\n<li><em>12 Rules for Life</em>, Jordan B. Petersen.</li>\n<li><em>The Fellowship of the Ring</em>, J.R.R. Tolkien. (Not really unfashionable in the zeitgeist, but did you know this book used to be considered counter-cultural?)</li>\n<li>The back catalogue of <a href=\"https://www.interest.co.nz/users/elizabeth-kerr\">Elizabeth Kerr, a former columnist for interest.co.nz</a>. An excellent financial guru, single-income dual-parent family with two kids—in short, relatable to most of us who still buy into a traditional family way of life. Dramatic suggestions for your financial freedom, she makes the impossible feel possible. With humour!</li>\n<li>The Spectator: <a href=\"https://www.spectator.co.uk/2019/06/diversitys-valued-unless-its-diversity-of-opinion/amp/\">Diversity’s valued — unless it’s diversity of opinion</a>.</li>\n<li>Sp¡ked: <a href=\"ttps://www.spiked-online.com/2019/06/18/the-trans-ideology-is-harming-kids/\">The trans ideology is harming kids</a>.</li>\n<li>New Zealand Centre for Political Research: <a href=\"https://www.nzcpr.com/new-zealands-maori-child-welfare-problem/\">New Zealand’s Maori Child Welfare Problem</a>, an incredible warning to those who are wary of the culture of perennial racial victimhood, and of welfare dependence.</li>\n<li>A similar theme to the above, but regarding the Treaty Settlement process in NZ, with lots of historical information about Ngai Tahu's situation: Otago Daily Times, <a href=\"https://www.odt.co.nz/opinion/complaint-industry-still-rambles\">Complaint industry still rambles on</a>. The ODT, <a href=\"https://www.odt.co.nz/opinion/simplicity-compounds-ignorance\">it seems</a>, continues to make a valuable contribution by mounting a rebuttal to recent revisionism of the 17- and 1800s.</li>\n<li>5–6 years ago I worked for a man who was an econometrician. Brutally intelligent and extremely mathematical. Retrospectively, he and his co-partner at the research institute have had an enormous influence on me. At the time, they were concerned about the hiring practices of the NZ Treasury. Apparently it's <a href=\"https://nzinitiative.org.nz/reports-and-media/opinion/howling-at-the-treasury-moon/\">only getting worse</a>.</li>\n<li>Ship of Fools: <a href=\"http://www.shipoffools.com/2019/07/in-praise-of-holy-fools/\">In praise of holy fools</a>.</li>\n</ul>\n<h1>Travelling</h1>\n<p>I recently had a work trip to Québec City for nine days for a workshop. The city is beautiful, particularly the churches in the old city. I went to Mass in French twice at <a href=\"https://en.wikipedia.org/wiki/Saint-Roch_Church_(Quebec_City)\">St-Roch</a>. At the first Mass, homeless people interrupted the Consecration, but to my joy the parishioners treated them with concern and compassion. Because I was excited to <em>finally</em> use old-style confessionals, I also went to Confession <em>twice</em> (once at St-Roch, and once at the <a href=\"https://en.wikipedia.org/wiki/Cathedral-Basilica_of_Notre-Dame_de_Qu%C3%A9bec\">Notre-Dame-de-Québec Cathedral-Basilica</a>).</p>\n<p>As a Catholic from a younger and less Catholic country, visiting Québec felt like a pilgrimage of sorts, although that was not at all my travel intention. While I do have a Québecois friend who takes his faith seriously and has been an important influence on my adult faith, it's rather the sheer number of churches that strikes you as an inescapable fact when wandering around the city. Now that quite a number of them have been deconsecrated and repurposed, and religosity in general being much lower than in the past, it's hard to comprehend why so many were needed in the first place.</p>\n<p>Thanks to Fr Dennis at Notre-Dame-de-Québec for outstanding pastoral advice; the advice you gave me during Confession really stuck with me. I asked him plainly, if you are in mortal sin, why not commit more sin? For the penalty would be the same. He first simply remarked, \"Do you want to try them all?\" Then he pointed out that sin always causes damage to oneself, or to others. Moreover, to continue to sin simply because you have already (mortally) sinned suggests the absence of contrition; and true contrition is a requirement for forgiveness. If you ever hope to be forgiven the sins you have already committed, the first step in developing a broken and contrite heart is to earnestly attempt to stop sinning, now, today, before you even approach the confessional.</p>\n<p><img src=\"images/quebec-1.jpg\" alt=\"Notre-Dame-des-Victoires: the oldest church in Quebec City—and the only one I wanted to go inside which I was unable to do so\" title=\"Notre-Dame-des-Victoires: the oldest church in Quebec City—and the only church that I wanted to go inside which I was unable to.\"></p>\n<h1>Parenting</h1>\n<p>Callum is seven months old tomorrow. He's sitting, but does not sit up of his own accord. That is, he'll stay sitting if we start him off that way. We read that spilling should have stopped by about 6 months for the average child, and we suspect that his delay in sitting up is directly linked to his continued spilling. Naturally we're sick of all the vomit and we really want him to sit more in order to develop his core muscles.</p>\n<p>Callum's really engaged with his toys. I try to read to him in the afternoon, but he's of an age where all he does is reach out to grab a book and put it in his mouth. I'm not sure if I should persevere or wait a bit longer.</p>\n<h1>Listening</h1>\n<p>Still lots of <a href=\"https://en.wikipedia.org/wiki/Chill-out_music#Lo-fi_hip_hop\">chill hop</a>.</p>\n<h1>Working</h1>\n<ul>\n<li>Linked Data implementations of the OGC API (i.e. WFS 3).</li>\n<li>Data visualisation of time series soil moisture, à la the Github <a href=\"https://github.com/DKirwan/calendar-heatmap\">\"calendar heatmap\"</a> as a React single page application.</li>\n<li>Researching the quantification of flood risk with a low data requirement. Currently considering the calculation of \"height above nearest drainage\" (HAND) normalised DEM. I will probably turn this into a plugin for QGIS 3.</li>\n<li>Still freelancing as well, although not as much as I could or should be.</li>\n</ul>\n<h1>Cooking</h1>\n<p>Lots of slow cooked meals for winter. It has <a href=\"https://kitchencookings.com/cooking-and-money-saving-are-slow-cookers-energy-efficient/\">financial benefits</a>; and given I'm on such a personal finance bender at the moment, I'm enamoured.</p>\n<blockquote>\n<p>Using a slow cooker is worth it because aside from cutting your energy cost for cooking, you also don’t have to spend all day in the kitchen watching the food not to burn as this will not happen at low temperatures.</p>\n<p>It also allows you to prepare healthy, delicious, home-cooked meals without spending much time and effort.</p>\n</blockquote>\n<p>You can also use cheaper cuts of meat, bought, naturally, from your local butcher.</p>\n<h1>Thinking</h1>\n<ul>\n<li>About the moral licitness of IVF.</li>\n<li>About P2P lending and whether it constitutes usury. Is P2P lending better, morally and financially, than putting your money in a bank and taking a 3% return? Charging <em>any</em> interest on a loan has historically been identified as usury, and considered gravely sinful. Keeping the money in a modern bank doesn't seem to carry much stigma. But given your bank is simply lending your deposited money out to people at 20% on a credit card in order to supply you with your 3%, and keeping the 17% difference, surely it's better to cut out the extortionate profits of the bank, and offer that borrower a 5-10% interest rate directly? As long as you can rely on the P2P platform to do due diligence on a borrower's creditworthiness. However I suppose <a href=\"https://en.wikipedia.org/wiki/Credit_union\">credit unions</a> are the true <a href=\"https://en.wikipedia.org/wiki/Distributism\">distributist solution</a> to the ethical issue of borrowing and lending for personal finance.</li>\n<li>About the benefits of a dumb phone.</li>\n</ul>\n<h1>Exercising</h1>\n<p><a href=\"https://www.stuff.co.nz/manawatu-standard/news/112328163/palmerston-norths-new-cycle-and-pedestrian-bridge-lights-up\">An enormously expensive new bridge</a> was built over the Manawatū river. The bridge considerably shortened my commute. I cycle over it each day; I'm planning to run more when it's warmer.</p>\n<h1>Learning</h1>\n<p>The basics of electronics, IoT, and sensors with an Arduino Uno. The local Jaycar electronics store recently ran an Arduino introductory tutorial that demystified a lot of this for me. I bought a book and I'm really excited about the possibilities. Hopefully I can learn enough to teach Callum in a few years. I'd love him to grow up to be the kind of person who makes physical things, not the kind of person who merely consumes what others make.</p>","frontmatter":{"title":"Recently","date":"09:30 PM, Tuesday July 30, 2019","updated":"09:47 PM, Wednesday April 29, 2020","path":null},"fields":{"slug":"/blog/recently/2019-07-30/"}}},"pageContext":{"slug":"/blog/recently/2019-07-30/","previous":{"fields":{"slug":"/blog/gis-se-improvement-tip-1/"},"frontmatter":{"title":"GIS StackExchange Improvement Tip #1","updated":null,"date":"2018-12-10T18:04:00.000Z","path":null,"tags":["stackexchange"]}},"next":null}}