{"data":{"site":{"siteMetadata":{"title":"Spatial Paralysis","author":"Richard Law"}},"markdownRemark":{"id":"ed894bb1-783b-5d8a-bcf3-d75ef7799d30","excerpt":"I have recently been fortunate enough to gain access to the real-time information (RTI) for buses and trains in the Wellington region. This…","html":"<p>I have recently been fortunate enough to gain access to the real-time information (RTI) for buses and trains in the Wellington region. This is the information that gets displayed in the box at your bus or train stop giving an estimate of how many minutes until your bus arrives. This information isn’t publicly available as a download or as an API, although you can try your luck looking at <a href=\"http://m.metlink.org.nz/stop/5006\" title=\"Change the number at the end of the URL for a different stop\">the mobile version of the Metlink website</a>. Building statistics from that is a different thing entirely. I tried to write a program to scrape the information, but you have to look at each stop individually and “Due”, “2 mins”, “3 mins”, etc. isn’t actually very useful beyond catching your service.</p>\n<p>Here is something I whipped up today. It demonstrates not only the travel time variation along a single bus route, but also how the mean travel time changes according to different conditions. In particular, I added information to the dates stored with the data to be able to distinguish trips made on “ordinary” weekdays where people are going to work and school, school holiday weekdays, and weekends.</p>\n<p>\n  <figure class=\"gatsby-resp-image-figure\" style=\"\">\n  \n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/ee4078f33ab093eebc4f53579944f0bb/09e95/airport91_ttcomparison.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 69.23990498812351%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAOCAYAAAAvxDzwAAAACXBIWXMAAAsSAAALEgHS3X78AAACEUlEQVQ4y21TiW6bQBDl/38maqJKkdJIldpKlVPVTrFFYmwM5jIYc5jDmGNfd5aACMlIo52dnXlzrlRVFZJzgiiK4LouLMsSchzHw9lzknR2Yz3pqrpCWzeo6xpSWZbwfQ+apsG2bXieBwrStu0HbppmOInrtzuRm0ZYeSak6/U6GPRERoyxDyyA+Qk2mKJqashHEzebOZaB2wH2AEMmk8zYJyBhkWIbeXjQl/hqKNACE+XRgNSXR07Ug3GmPVGAkveJypp7Ou53Mr5sn3Gnr/A3sFCEBuL5I9y1AulyuQgQAiSZehpeMryeHO5s4LezwTdjhTvtGbeajAdLhXyyYUUuknCPQp3Bnn3HXjWRFXwo5/NZgDVtl5kaHnCzXeDefOHOa/xwNSx4jzahDf9koTysOcgTEvknvPkvWC8qkrTuKuFVDEMRJfNzGdiwjzqyg4rSVnAx/iFb/0H2OkOsPOGgLOHtHQRByjPiUx4Nkto3AHJEJFUJY0cAC4Q7FZFlInIdxEGIOMqR5jVqNu4un74YHPsEkJMdOPAtXThR5BbvhtsBsPEGsHcbMgCSwo8D7EyNR2QdDOt4uosCdiQPod62RKzNMfDheo6YMN3pYcykoyooOMm9zVRH/lJRFOI/0iXLMqRpKu4k0wb0f5d0Yz3Z9X85z3MQDq2dNE1d/AQejRyJKYM+y2HReWaUAL1N6T9mEzUca1K5EwAAAABJRU5ErkJggg=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Travel time data from the Greater Wellington Regional Council (GWRC), for the Airport Flyer (route 91).\"\n        title=\"Travel time data from the Greater Wellington Regional Council, for the \"Airport Flyer\".\"\n        src=\"/static/ee4078f33ab093eebc4f53579944f0bb/b6638/airport91_ttcomparison.png\"\n        srcset=\"/static/ee4078f33ab093eebc4f53579944f0bb/60f18/airport91_ttcomparison.png 148w,\n/static/ee4078f33ab093eebc4f53579944f0bb/9d7cc/airport91_ttcomparison.png 295w,\n/static/ee4078f33ab093eebc4f53579944f0bb/b6638/airport91_ttcomparison.png 590w,\n/static/ee4078f33ab093eebc4f53579944f0bb/deb91/airport91_ttcomparison.png 885w,\n/static/ee4078f33ab093eebc4f53579944f0bb/990fb/airport91_ttcomparison.png 1180w,\n/static/ee4078f33ab093eebc4f53579944f0bb/09e95/airport91_ttcomparison.png 1684w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    \n  <figcaption class=\"gatsby-resp-image-figcaption\">Travel time data from the Greater Wellington Regional Council, for the \"Airport Flyer\".</figcaption>\n  </figure>\n      </p>\n<p>This data covers all of April 2014. This year, both primary and secondary school holidays began on April 17, and lasted until May 5, so the data is split roughly evenly between weekdays where little Johhny is being ferried to school, and days when he is not. Most of us know from experience that traffic congestion is worse in the school term than in the school holidays. But how much? Well, if we take <a href=\"http://www.metlink.org.nz/timetables/bus/091/inbound\" title=\"Click to see the route\">the Airport Flyer bus route</a> as a unit of analysis, school-related congestion adds about 14 minutes of travel time across the length of the route. This mostly accrues between Jackson St and Murphy St. For those of you playing at home, that’s the longest stretch between stops at approximately 15 kilometres, and takes in the busiest section of State Highway 2 and the urban motorway. However, from experience as a rider on this route, a lot of this additional travel time comes from Petone (Jackson St/Hutt Rd, attempting to get onto SH2). Also from experience as a resident in Petone, <strong>school congestion is a total time killer</strong>.</p>\n<span className=\"newthought\">\n<h5>What can cause variation in travel time apart from school-related congestion?</h5>\n<p>Influences include: passengers getting on and off; road maintenance; bus driver behaviour; non-school related road congestion; the weather.</span></p>\n<p>Now, it is possible to separate out these different effects, although I leave that as an exercise for the reader. I picked only a single month to ensure I’d be comparing apples with apples to the greatest extent possible.{% sidenote ‘sn-id-example’ ‘Admittedly, April <strong>did</strong> see a bit of roadworks between Petone and Wellington that would have affected this route. However, this work was being performed just as intensely during the school term and the weekend as for the rest of April---so there is no reason to attribute the difference to that.’%}</p>\n<p>School children don’t typically board the Airport bus, not only because it goes to the Airport, but because it carries a surcharge. Some amount of variation is perhaps due to buses on this route getting stuck behind the buses on other routes which school children are boarding in the school term, and are not boarding in the holidays.</p>\n<p>It’s been noted that New Zealand has seen a significant increase in the proportion of children and teenagers who are driven (or drive themselves) to school. Often the impact on obesity is noted, as well as the opportunity cost of missed early morning exercise which could help boost attention spans.</p>\n<p>However, I have not seen it mentioned how this effects our transport system beyond a general acceptance that congestion is worse. Although I have only shown you one chart, I have played around with displaying the same information for a variety of routes. The typical result for buses is that the mean travel time is greater during the school term than outside of it. In terms of the variation around this mean, every example\nI have plotted has shown a much greater standard deviation of travel time.</p>\n<p>What does that mean? It means buses are generally getting stuck in school traffic, causing people to be <strong>later than they otherwise need to be</strong>, or making them leave home earlier than otherwise. It means <strong>buses are more late more often</strong>; people have <strong>less certainty about their arrival time</strong>, and the <strong>schedule becomes less and less useful as a tool to reduce the amount of time you spend waiting</strong>.</p>\n<p>Notably, the effect is much more limited for rail services, which do not want to put up with any of that school-gate SUV madness.</p>","frontmatter":{"title":"Commuting and dropping the kids off at school","date":"05:44 PM, Friday June 13, 2014","updated":null}}},"pageContext":{"slug":"/the-school-run/","previous":{"fields":{"slug":"/global-travel-isochrone-1881/"},"frontmatter":{"title":"Global Isochrone Travel Time from London (1881)","updated":null,"date":"2014-06-13T10:33:38.000Z","path":"/blog/2014-06-13-global-isochrone-travel-time-from-london-1881","tags":["cartography"]}},"next":{"fields":{"slug":"/traffic-dashboard/"},"frontmatter":{"title":"NZ Traffic Dashboard","updated":null,"date":"2017-12-31T14:25:00.000Z","path":"/blog/nz-traffic-dashboard","tags":["portfolio","development","react","javascript","transport","New Zealand","NZTA"]}}}}